{
    "status": "ok",
    "feed": {
        "url": "https://blog.codeship.com/author/chrisward/feed/",
        "title": "Chris Ward – via @codeship",
        "link": "https://blog.codeship.com/",
        "author": "",
        "description": "Codeship's Software Development, Coding &amp; DevOps Blog | Codeship Blog",
        "image": ""
    },
    "items": [
        {
            "title": "What is Artificial Intelligence?",
            "pubDate": "2018-07-19 15:15:23",
            "link": "https://blog.codeship.com/what-is-artificial-intelligence/",
            "guid": "https://blog.codeship.com/?p=6569",
            "author": "Chris Ward",
            "thumbnail": "",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span>Before we begin, let’s get definitions straight — what is artificial intelligence (AI)? Or more specifically, what isn’t it? As you might expect, ask any technical person for a definition of something, and you’ll get a dozen different responses, and at least half of them will be, “It depends.” In my humble opinion, AI is […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/what-is-artificial-intelligence/\">What is Artificial Intelligence?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span><p>Before we begin, let’s get definitions straight — what is artificial intelligence (AI)? Or more specifically, what isn’t it? As you might expect, ask any technical person for a definition of something, and you’ll get a dozen different responses, and at least half of them will be, “It depends.”</p>\n<p>In my humble opinion, AI is a machine or program that learns from its experience and adapts its behavior accordingly.</p>\n<hr>\n<p><em>“AI is a machine or program that learns from its experience and adapts its behavior accordingly.”</em><br><a href=\"https://twitter.com/share?text=%22AI+is+a+machine+or+program+that+learns+from+its+experience+and+adapts+its+behavior+accordingly.%22&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>As much as I love chatbots and voice interfaces, this excludes most of them, as they tend to have a static selection of knowledge and interactions. Their developers may learn from application logs and change the application over time, but that’s not the same. Current popular and widespread applications of AI include game intelligences (playing or running), self-driving cars, and object manipulation and perception.</p>\n<p>AI is not new; I even took a handful of AI modules at university way back in the distant past of 2002, and it’s history stretches back much further than that. While techniques have existed for some time, recent demand and plunging hardware prices have created a surge of activity, interest, projects, and applications.</p>\n<p>Many other technologies come under the general AI umbrella that you have likely heard about, including machine learning for training an intelligence, and a variety of technologies for processing inputs and outputs (language processing, image recognition, etc.). AI is a big topic to try to summarize, and in the words that follow, I am simplifying as much as possible, so bear that in mind. Okay, here we go!</p>\n<h2>Machine Learning</h2>\n<p>Think of machine learning as (somewhat) similar to humans going to school. It’s when your application gains the initial knowledge it needs to be useful and builds upon as it learns from experience. Much like humans at school, it has the ability to make judgments and act, dependent on what it learns and how you taught it.</p>\n<hr>\n<p><em>“Machine learning is somewhat similar to humans going to school.” via @chrisward</em><br><a href=\"https://twitter.com/share?text=%22Machine+learning+is+somewhat+similar+to+humans+going+to+school.%22+via+%40chrisward&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>If you give an application a disconnected, limited, or biased information set, then it may not be as effective. Getting the balance right for training an AI is hard, and (more than normal in the tech space), <strong>really</strong> depends on your use case. If you are creating an AI for a niche use case, with a smaller data set available, then it won’t need as much training as an AI for a broader purpose, or one where you can potentially pull from a lot of data sources.</p>\n<h2>Deep Learning and Neural Networks</h2>\n<p>A subset of machine learning, deep learning focuses on attempting to replicate the way the human brain works. That’s a mysterious statement, as we don’t even fully understand how the human brain works; it’s more that now computing power allows us to emulate better how we perceive the human brain works, and how it learns from experience.</p>\n<hr>\n<p><em>“Deep learning is a subset of machine learning, emulating how the brain learns from experience.”</em><br><a href=\"https://twitter.com/share?text=%22Deep+learning+is+a+subset+of+machine+learning%2C+emulating+how+the+brain+learns+from+experience.%22&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>Neural networks are the method behind deep learning, multiple nodes that undertake tasks by considering examples and then sharing their experiences with other nodes in their network. If one node learns what success with a task equals, they can share that with all the other nodes, and move onto new experiments.</p>\n<h2>Cognitive Computing</h2>\n<p>If you thought the definitions so far were broad, then prepare to be surprised, as there is no agreed definition of cognitive computing, so I will attempt my own.</p>\n<p>If neural networks attempt to simulate the brain, then I think cognitive computing helps enhance that “brain” with useful sensory information. This information includes textual and aural language, images, heat, spatial awareness, and more. The stream of extra data supplied to the network helps it adapt and respond to changes, making decisions based upon them.</p>\n<hr>\n<p><em>“Cognitive computing helps enhance the simulated ‘brain’ with useful sensory information.”</em><br><a href=\"https://twitter.com/share?text=%22Cognitive+computing+helps+enhance+the+simulated+%27brain%27+with+useful+sensory+information.%22&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Computer Vision</h2>\n<p>While some may now consider it a part of cognitive computing, computer vision is more established with a longer history; I even remember image recognition being one of my favorite units at university.</p>\n<hr>\n<p><em>“Computer vision may be part of cognitive computing, but it has a more established history.”</em><br><a href=\"https://twitter.com/share?text=%22Computer+vision+may+be+part+of+cognitive+computing%2C+but+it+has+a+more+established+history.%22&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>In an AI context, “vision” also includes images we aren’t used to seeing, as machines can also process other types of visual input that we can’t, such as x-ray or infrared.</p>\n<h2>Natural Language Processing (NLP)</h2>\n<p>As a writer, NLP is the aspect of AI most interesting to me. Again, it’s not a new discipline, but recent advances have pushed it further forward. NLP deals with interpreting written or spoken human language to understand its content, context, and intent, as well as responding to a human appropriately based on what its learned.</p>\n<hr>\n<p><em>“Natural Language Processing is not a new aspect of AI, but recent advances push it forward.”</em><br><a href=\"https://twitter.com/share?text=%22Natural+Language+Processing+is+not+a+new+aspect+of+AI%2C+but+recent+advances+push+it+forward.%22&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Tools and Libraries</h2>\n<p>When it comes to tool and library recommendations, there are some specific to each section and others that span multiple categories. A lot of libraries in this field are aimed at Python developers, but I’ll try to include a few that support other languages, too.</p>\n<h3>Major cloud providers</h3>\n<p>IBM is pushing hard on their already infamous AI tools and platform; <a href=\"https://www.ibm.com/watson/developer/\">Watson</a> has a service and library to suit most of the use cases above, often with an option to self-host or run in their cloud.</p>\n<p>Unsurprisingly, all the leading cloud providers have their offerings. Here’s what <a href=\"https://ai.google/tools/\">Google has to offer</a> (which includes the popular TensorFlow), Azure <a href=\"https://azure.microsoft.com/en-us/overview/ai-platform/\">here</a> and <a href=\"https://azure.microsoft.com/en-us/services/machine-learning-studio/\">here</a>, and finally, AWS <a href=\"https://aws.amazon.com/machine-learning/\">here</a> and <a href=\"https://aws.amazon.com/mp/ai/\">here</a>.</p>\n<p>There are also plenty of self-installed open-source options, and a quick internet search results in dozens of options. Here’s a small selection of the common favorites.</p>\n<ul>\n<li>\n<strong><a href=\"https://keras.io/\">Keras</a></strong>, a high-level neural networks Python library that can sit on top of other deep-learning libraries aimed at making experimentation with models easier.</li>\n<li>\n<strong><a href=\"https://mxnet.apache.org/\">MXNet</a></strong>, a new but already popular deep-learning library that supports multiple programming languages and deployment methods.</li>\n<li>\n<strong><a href=\"https://deeplearning4j.org/\">Deeplearning4j</a></strong> is a JVM-based deep-learning library that also has an enterprise-friendly offering with built-in visual notebooks for experimentation.</li>\n<li>\n<strong><a href=\"https://spark.apache.org/mllib/\">Spark MLib</a></strong>, if you are already using Spark for data streaming, then this additional library helps you do more with that data.</li>\n<li>\n<strong><a href=\"https://opencv.org/\">OpenCV</a></strong> is a widely used (and supported) library for computer vision.</li>\n<li>\n<strong><a href=\"https://www.simplecv.org/\">SimpleCV</a></strong> is similar and snapping at its heels.</li>\n<li>\n<strong><a href=\"https://www.nltk.org/\">NLTK</a></strong> is a Python library for processing and understanding natural language.</li>\n<li>And for the JVM users, <strong><a href=\"https://opennlp.apache.org/\">OpenNLP</a></strong> is what you’re looking for.</li>\n</ul>\n<h2>Ethics</h2>\n<p>Technically minded folks may wonder why I’ve added this point, but it’s something important to me, so I’m sneaking it in.</p>\n<p>As we (as businesses and societies) become more reliant on AI to undertake an increasing amount of tasks for us, we need to be careful. I’m not a believer in sci-fi predictions of killer robots, but there are other real and more immediate issues related to AI.</p>\n<hr>\n<p><em>Tech’s lack of diversity is relevant when automated systems make decisions based on training data.</em><br><a href=\"https://twitter.com/share?text=Tech%27s+lack+of+diversity+is+relevant+when+automated+systems+make+decisions+based+on+training+data.&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The lack of diversity in the tech industry is especially relevant when it comes to unsupervised automated systems making decisions based on training data. I don’t think engineers intentionally introduce biased data into their machine-learning models, but we are often unaware of our own subconscious biases, especially when there is no one different from us in our team to challenge what we do as “not right.” Remember…</p>\n<blockquote>\n<p>Algorithms aren’t biased, but people are.</p>\n</blockquote>\n<hr>\n<p><em>“What is Artificial Intelligence?” via @chrisward</em><br><a href=\"https://twitter.com/share?text=%22What+is+Artificial+Intelligence%3F%22+via+%40chrisward&amp;url=https://blog.codeship.com/what-is-artificial-intelligence/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/what-is-artificial-intelligence/\">What is Artificial Intelligence?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"Industry"
            ]
        },
        {
            "title": "What Is Blockchain?",
            "pubDate": "2018-06-26 15:15:30",
            "link": "https://blog.codeship.com/what-is-blockchain/",
            "guid": "https://blog.codeship.com/?p=6536",
            "author": "Chris Ward",
            "thumbnail": "",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span>The world and its dog has gone crazy for blockchain (and related technologies, which is a whole other post). The past two years have been a hype roller coaster for the technology with stories of equally insane valuations, technical proposals, media exposure, regulatory nightmares, frauds, and unrealized dreams. But what is the technology, and why […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/what-is-blockchain/\">What Is Blockchain?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span><p>The world and its dog has gone crazy for blockchain (and related technologies, which is a whole other post). The past two years have been a hype roller coaster for the technology with stories of equally insane valuations, technical proposals, media exposure, regulatory nightmares, frauds, and unrealized dreams.</p>\n<p>But what is the technology, and why could it be of interest to developers like yourselves?</p>\n<p>Before I get started, speaking about “blockchain” is like speaking about “programming” in that there are multiple differences in paradigms, approaches, and patterns, most of which their communities are still defining. In some ways, this is why I find the technology so compelling, but it makes it hard to define the technology completely.</p>\n<p>For simplicity, I use Ethereum as the reference technology in this post, because it is more interesting to developers, sparked the broader use of blockchain beyond Bitcoin, and other approaches use it, replicate it, or compete with it.</p>\n<hr>\n<p><em>“Talking about ‘blockchain’ is like talking about ‘programming’; there are multiple approaches.”</em><br><a href=\"https://twitter.com/share?text=%22Talking+about+%27blockchain%27+is+like+talking+about+%27programming%27%3B+there+are+multiple+approaches.%22&amp;url=https://blog.codeship.com/what-is-blockchain/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Blockchain’s Basic Definition</h2>\n<p>My absolute basic, abstract definition of blockchain is:</p>\n<blockquote>\n<p>A cryptographically secure distributed ledger of transactions that is generally immutable and keeps all instances in the cluster informed of changes.</p>\n</blockquote>\n<p>I know people will want to dispute this, change, and add to it, but I’d like to stick with broad strokes right now.</p>\n<p>Let’s take a quick tangent as to what “cryptographically secure” means before continuing. All blockchains use public-key cryptography to sign transactions, associate them with an origin, and achieve consensus on the state of the network.</p>\n<p>Blockchains also often use a chain of hashes to bundle transactions for extra security and some efficiency improvements. The hash chains are then written to blocks that contain a reference to previous blocks to maintain a reliable sequence of events.</p>\n<p>The exact implementation of this process varies wildly from protocol to protocol. For Ethereum, you can read <a href=\"https://github.com/ethereum/yellowpaper\">the yellow paper</a> for more details.</p>\n<h2>Comparing Blockchain to Distributed Systems</h2>\n<p>For those of you with experience in distributed systems and especially distributed databases, this definition might sound somewhat familiar. I am often surprised how little the blockchain community is aware of fundamental distributed system concepts, thinking that everything they are doing is something new and original, but hey. that’s technologists for you!</p>\n<p>Where things start to differ is in the definition of <em>cluster</em>. In “traditional” distributed systems, the time-honored formula of <code>2n+1</code> applies in defining how many nodes to add to a cluster, and getting the right number takes time. Too little and the cluster may not cope with demand; too many and replicating data across the cluster can be too slow.</p>\n<p>With the Ethereum blockchain, there is only one cluster (well, actually four, but the others are test networks). When you write and read transactions to it, they are replicated across the entire network, typically around 20,000 nodes at the time of writing.</p>\n<p>Herein lies most of the point of blockchain technologies, by having all nodes and data public, you create a decentralized network, with a mutual trust of that data, and a consensus algorithm (that varies from protocol to protocol) that determines if a transaction submitted is valid or not, and subsequently written.</p>\n<p>This also leads to the biggest problem with many blockchain protocols (but not all), in that large-scale replication makes transactions slow. There are numerous supplements to existing blockchain protocols and entirely new protocols that look to solve this, but it’s not entirely solved and production-tested yet.</p>\n<p>While there are dozens of super interesting projects built on blockchain (often Ethereum, or something like it) that look to challenge the entire contemporary computing stack (<a href=\"https://techbeacon.com/how-blockchain-will-disrupt-traditional-computing\">I wrote another post on this subject</a>), until the community solves this speed and scalability issue, they are mostly experiments and proofs of concept.</p>\n<h2>Public Versus Private Blockchains</h2>\n<p>There is another option to consider, and that’s <em>private blockchains</em>, with <a href=\"https://hyperledger.org/\">Hyperledger</a> being one of the most mature and established, but there are others to consider. These protocols offer you many of the features of a public blockchain (decentralized consensus, for example), but control who runs instances, where they run, and the number of instances. Private blockchains are somewhat controversial in the community, as in many opinions they go against the “point,” while others believe that it’s too much like a conventional distributed system to have any point.</p>\n<p>Still, the decentralized consensus nature versus the conventional account and access setup is potentially compelling.</p>\n<h2>Ethereum Components</h2>\n<p>With all this aside, what does the Ethereum blockchain consist of? Quite a lot actually, which makes it more complex/interesting, depending on your perspective.</p>\n<p>A simple illustration is hard to come by, but I recommend you take a look (and be overwhelmed by) <a href=\"https://github.com/4c656554/BlockchainIllustrations/tree/master/Ethereum\">this comprehensive image</a> created by LeeJThomas. The fundamental components to gain an overview, in my mind, are:</p>\n<ul>\n<li>\n<strong>Solidity smart contracts:</strong> The ‘magic sauce’ that Ethereum introduced to the world. These allow you to run simple applications attached to the blockchain. Other blockchain protocols have their own smart contract languages; <a href=\"https://github.com/s-tikhomirov/smart-contract-languages\">this repository has a good summary</a>.</li>\n<li>\n<strong>The Ethereum Virtual Machine (EVM):</strong> The contracts are compiled into <em>bytecode</em>, which the EVM reads and executes. The EVM is sandboxed and isolated from the host machine.</li>\n<li>\n<strong>Swarm and Whisper:</strong> Working with the EVM, Whisper provides communication channels between applications running on the network (called <em>DApps</em>), and Swarm provides storage for the application code and any data written by an application.</li>\n<li>\n<strong>web3.js (and other SDKs):</strong> For a long time, I didn’t understand how you integrated Ethereum into a “real” application, and granted, some abstraction remains, but with JSON RPC endpoints for C++, Python, Go, and web3 for JavaScript, the options aren’t too bad.</li>\n<li>\n<strong>Integration tools:</strong> There are a handful of widely adopted tools for handling migration and deployment of smart contracts. Due to the complete immutability of transactions and contracts, you can’t update a contract once you have deployed it. There are a variety of techniques to work around this limitation, but an interesting aspect of blockchain programming is that there’s much more impetus to get it right the first time around.</li>\n</ul>\n<h3>Costs</h3>\n<p>Another interesting aspect of Ethereum and other blockchains is how you pay for access. Every smart contract deployed to the main Ethereum network consumes “gas” when it runs, again showing that efficiency and “getting it right are paramount.</p>\n<p>You can think of this cost as somewhat equivalent to paying for services on your cloud host of choice. It’s hard to make a comparable cost comparison, but while cloud providers don’t always encourage efficient usage, the blockchain does; your code directly relates to cost.</p>\n<p>To gain gas, you need ether, the token of the Ethereum network, which you can buy or trade from others, or you provide computing resources (<em>mining</em>) to the network and gain ether for doing so.</p>\n<h2>What Does Blockchain Mean to Developers?</h2>\n<p>This post was a brief and broad introduction to the blockchain, and I promised to say why developers should care about it.</p>\n<p>Some fans and critics say that the blockchain space right now is like the nascent internet days in the late ’90s. Everyone is competing for a half-baked, over-hyped idea that few understand, think is needed, or think is possible. Anyone who is old enough to remember the dot-com bubble burst of the late ’90s may remember the number of promising and dumb ideas that failed, leaving in their wake a mixture of much better ideas, or ideas that managed to survive and define the modern internet.</p>\n<p>Time will tell if the same happens with blockchain, and thankfully we are slowly filtering the noise of the ICO madness of late 2017 in time to readdress some of the original ideals of blockchain. These ideals were that too much power and influence lay in the hands of too few, and by decentralizing as much as possible, we create the internet that everyone envisioned in the first place.</p>\n<p>Again, some critics say that some blockchain protocols and networks are way more centralized than they allude to and that it’s already too late.</p>\n<p>But hey, if some of the ideas in this article encouraged you to try to work on something different, then find a project that interests you and get involve. These are early days, and everyone can still play a part.</p>\n<p><em>Thanks to <a href=\"https://whoisjuliosantos.com/\">Júlio Santos</a> for reviewing this post for me.</em></p>\n<hr>\n<p><em>“What Is Blockchain?” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22What+Is+Blockchain%3F%22+via+%40chrischinch&amp;url=https://blog.codeship.com/what-is-blockchain/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/what-is-blockchain/\">What Is Blockchain?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"Development"
            ]
        },
        {
            "title": "The Promises, Payoff, and Products of Hybrid Clouds",
            "pubDate": "2018-04-26 15:15:53",
            "link": "https://blog.codeship.com/the-promises-payoff-and-products-of-hybrid-clouds/",
            "guid": "https://blog.codeship.com/?p=6356",
            "author": "Chris Ward",
            "thumbnail": "",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span>The cloud promised to provide us all flexibility. The opportunity to access infinite resources as and when we need them and pay accordingly. We would no longer have to spend time installing, configuring and maintaining servers; we were promised more time to “just code.” Instead, we got increasing vendor lock-in and a handful of cloud […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/the-promises-payoff-and-products-of-hybrid-clouds/\">The Promises, Payoff, and Products of Hybrid Clouds</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span><p>The cloud promised to provide us all flexibility. The opportunity to access infinite resources as and when we need them and pay accordingly. We would no longer have to spend time installing, configuring and maintaining servers; we were promised more time to “just code.”</p>\n<p>Instead, we got increasing vendor lock-in and a handful of cloud players so large that if a data center experiences problems, significant sections of the internet go offline. Naturally, we created more tools and practices to cope with the problem we created for ourselves, and dear readers, welcome to <em>hybrid clouds</em>.</p>\n<p>I am of course being slightly facetious. In reality, hybrid clouds are a method for building flexibility and redundancy into a cloud infrastructure. The past decade has taught us that relying on one provider is a bad idea, and we should use a mixture of public and private platforms and switch between them as required for operational or financial reasons.</p>\n<hr>\n<p><em>“The past decade has taught us that relying on one provider is a bad idea; enter hybrid clouds.”</em><br><a href=\"https://twitter.com/share?text=%22The+past+decade+has+taught+us+that+relying+on+one+provider+is+a+bad+idea%3B+enter+hybrid+clouds.%22&amp;url=https://blog.codeship.com/the-promises-payoff-and-products-of-hybrid-clouds/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Reasons to Use Hybrid Clouds</h2>\n<p>There are several reasons you might want to consider a hybrid cloud instead of throwing all your egg-shaped services into one cloud-shaped basket.</p>\n<h3>Privacy</h3>\n<p>For regulatory or architectural reasons, an application may contain data that you need to store in particular regions or on servers that you have more control over.</p>\n<h3>Financial</h3>\n<p>Some cloud providers provide better value for certain services than others, or you might want to take advantage of the best deals with specific providers.</p>\n<h3>Custom services</h3>\n<p>While increasingly unlikely as most software vendors rush to the cloud, you may have legacy or custom services that only run on particular private machines or third-party providers. This includes services that you intend to migrate eventually but haven’t yet.</p>\n<h2>Considerations Before Adopting a Hybrid Cloud Solution</h2>\n<p>It may surprise you to hear, but most cloud providers are supportive of hybrid clouds, especially those that connect their services to legacy and on-premises systems. After all, they are removing barriers for potential customers. Here’s a couple of factors to consider in your hybrid-cloud strategy.</p>\n<h3>Incompatibility</h3>\n<p>While in theory developer standards are widely adopted, you can potentially experience library or protocol inconsistencies between providers, so do your research and testing before a major rollout.</p>\n<h3>Security</h3>\n<p>As I hope you are already doing, naturally you need to encrypt all communications between services and make sure that public endpoints are secured.</p>\n<h3>Performance</h3>\n<p>Again, although cloud services, CDNs, and transmission mechanisms are continually improving, the more hops you introduce, the more the opportunity for lag, latency, and ‘moving parts’ that you need to debug in case of a problem.</p>\n<h2>Tools</h2>\n<p>Now for everyone’s favorite discussion, let’s talk about the tools available to help you create, manage, and tweak your hybrid cloud setup. I’ve tried to break them into categories, but there is some crossover.</p>\n<h3>Cloud providers</h3>\n<p>AWS has an entire suite of tools to help their services form a part of your hybrid cloud, including:</p>\n<ul>\n<li>\n<a href=\"https://aws.amazon.com/storagegateway/\">AWS Storage Gateway</a>: for using on-premises storage as part of AWS storage devices</li>\n<li>\n<a href=\"https://aws.amazon.com/vpc/\">Amazon VPC</a>: for creating a VPN between AWS and other parts of your network, plus the capability to manage IP address ranges if you need to use specific values</li>\n<li>\n<a href=\"https://aws.amazon.com/directconnect/\">AWS Direct Connect</a>: similar to VPC but for creating direct connections</li>\n<li>\n<a href=\"https://aws.amazon.com/opsworks\">AWS OpsWorks</a>: for those of you following “infrastructure as code” practices, AWS’s offering can also manage on-premises servers</li>\n</ul>\n<p>Azure has a similar offering in the form of <a href=\"https://azure.microsoft.com/en-us/overview/azure-stack/\">Azure Stack</a>. What features it offers and how you use them is a little unclear and lurks behind a sign-up form. Other tools offered by Azure that relate to hybrid clouds are:</p>\n<ul>\n<li>\n<a href=\"https://azure.microsoft.com/en-in/services/logic-apps/\">Logic Apps</a>: for pulling data from on-premises applications into public cloud applications</li>\n<li>\n<a href=\"https://azure.microsoft.com/en-in/services/service-bus/\">Service Bus</a>: for inter-cloud messaging</li>\n<li>\n<a href=\"https://azure.microsoft.com/en-in/services/storsimple/\">StorSimple</a>: for consolidated storage</li>\n</ul>\n<p>You can integrate many of the smaller hosting players with a hybrid cloud, using any of the commercial tools below that support your provider(s), or a roll-your-own option if you put in the work. There are companies like <a href=\"https://www.joyent.com/\">Joyent</a> who focus their business on helping you integrate them with other larger players, which is a smart move, and <a href=\"https://github.com/joyent/triton\">open-source their tools</a>.</p>\n<h3>Commercial tools</h3>\n<p>One of the many all-in-one solutions, <a href=\"https://www.corestack.io/\">CoreStack</a> coins another buzzword to add into the mix: <em>cloud governance</em>. Aimed more at operations and business people than developers, the service focuses on defining how your services fit together based on consumption and cost and don’t provide a tremendous amount of detail before an appointment with sales.</p>\n<p>There are also a handful of companies such as <a href=\"https://www.parkmycloud.com/\">ParkMyCloud</a> and <a href=\"https://replex.io/\">Replex</a> that focus entirely on the money-saving aspect, helping you save as much money as possible by shifting application components around as efficiently as possible.</p>\n<p><a href=\"https://www.incontinuum.com/\">Cloud Controller</a> pull in a lot of enterprise-friendly service providers such as Oracle, Citrix, and Red Hat. With another new buzzword is <a href=\"https://www.nutanix.in/\">Nutanix</a> and their “hyperconverged infrastructure technology.” They both have an impressive client list and support a lot of enterprise-friendly software components, but again it’s hard to know how their platform works.</p>\n<p>Finally, of course, Cisco has their own solution in the shape of <a href=\"https://www.cisco.com/c/en/us/products/cloud-systems-management/cloudcenter/index.html\">CloudCenter</a> that has a few extra useful features such as budget plans, centralized security, and supports over 20 providers.</p>\n<h3>Open-source tools</h3>\n<p>There are plenty of choices in the open-source realm too that you can install and manage yourself, or find preinstalled on public and private clouds. While many developers will use more complex (and thus scalable options) for managing Docker containers across multiple hosts, for simple setups, Docker <a href=\"https://docs.docker.com/machine/\">machine</a> and <a href=\"https://docs.docker.com/swarm/\">Swarm</a> could be enough for your needs.</p>\n<p>A small project called Kubernetes has hybrid cloud functionality (or as they call it “cluster federation”) in the form of <a href=\"https://kubernetes.io/docs/tasks/federation/set-up-cluster-federation-kubefed/\">kubefed</a>. It’s a little complex to set up, but <a href=\"https://medium.com/google-cloud/experimenting-with-cross-cloud-kubernetes-cluster-federation-dfa99f913d54\">read this Google blog post</a> for some ideas. If you are interested in Kubernetes but don’t want install and manage it yourself, then look no further than my roundup of <a href=\"https://blog.codeship.com/a-roundup-of-managed-kubernetes-platforms/\">Kubernetes managed hosting options</a>.</p>\n<p>Somewhat overshadowed by Kubernetes these days but still a powerful option is <a href=\"https://mesos.apache.org/\">Apache Mesos</a>, which uses interesting paradigms to treat your distributed computing resources as one collective whole.</p>\n<p>In a similar vein is <a href=\"https://www.openstack.org/\">OpenStack</a>, which puts hybrid clouds front and center, and I would hazard a guess that some of the commercial vendors use it behind the scenes as well.</p>\n<p>Lesser known but with equal vintage and aims is <a href=\"https://cloudstack.apache.org/\">Apache CloudStack</a>.</p>\n<p>An older but well-established option is <a href=\"https://opennebula.systems/opennebula/\">OpenNebula</a>, it’s not immediately apparent that it’s open source (thought it declares loudly that it is). After some digging, I finally found <a href=\"https://github.com/OpenNebula/\">the codebase</a>.</p>\n<p>Finally, take a look at <a href=\"https://oneops.com/\">OneOps</a> from Walmart, yes, the retail chain. At least you know it’s production-tested.</p>\n<h3>Monitoring</h3>\n<p>Tools for monitoring hybrid clouds are also plentiful. What you choose mostly depends on your setup and what you want to monitor. Common tools such as <a href=\"https://www.datadoghq.com/\">DataDog</a>, <a href=\"https://newrelic.com/resource/new-relic-for-hybrid-cloud\">New Relic</a>, <a href=\"https://prometheus.io/\">Prometheus</a>, and the <a href=\"https://www.elastic.co/elk-stack\">Elastic stack</a> should suit your needs and are widely available.</p>\n<h2>Future Flexible</h2>\n<p>In reality, the hybrid cloud is what the cloud should have been in the first place: a flexible suite of services that do what we ask, when we ask, and charge us accordingly.</p>\n<p>Granted, a hybrid cloud requires more initial steps than we might have all hoped, but few people also want to run and maintain their own servers anymore, so it’s a happy compromise.</p>\n<hr>\n<p><em>“The Promises, Payoff, and Products of Hybrid Clouds” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22The+Promises%2C+Payoff%2C+and+Products+of+Hybrid+Clouds%22+via+%40chrischinch&amp;url=https://blog.codeship.com/the-promises-payoff-and-products-of-hybrid-clouds/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/the-promises-payoff-and-products-of-hybrid-clouds/\">The Promises, Payoff, and Products of Hybrid Clouds</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"DevOps"
            ]
        },
        {
            "title": "What Is DesignOps?",
            "pubDate": "2018-03-27 15:15:13",
            "link": "https://blog.codeship.com/what-is-designops/",
            "guid": "https://blog.codeship.com/?p=6239",
            "author": "Chris Ward",
            "thumbnail": "https://blog.codeship.com/wp-content/uploads/2018/03/do-figma.png",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span>As a writer/tech writer/sometimes developer who dabbles in the odd bit of illustration and design, I have often wondered how teams of artists collaborate. While I remember the days of working on code with FTP uploads and SVN, code collaboration is, relatively speaking, “solved.” Code is fundamentally text, and so tracking changes to it is […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/what-is-designops/\">What Is DesignOps?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span><p>As a writer/tech writer/sometimes developer who dabbles in the odd bit of illustration and design, I have often wondered how teams of artists collaborate.</p>\n<p>While I remember the days of working on code with FTP uploads and SVN, code collaboration is, relatively speaking, “solved.” Code is fundamentally text, and so tracking changes to it is reasonably straightforward, unless lots of people make changes all at once.</p>\n<p>With binary objects, proprietary formats, and large file sizes, how can designers do something similar with the tools available to them? How does a team of designers know that another team member changed the shade of blue or shifted the logo to the left?</p>\n<p>I came across the term “<a href=\"https://www.thoughtworks.com/radar/techniques/designops\">DesignOps in a ThoughtWorks radar</a>” and wanted to dig into the topic. It’s a new term (and sometimes called Design System Ops), with no defined tools and practices. As a result, this post is a mix of thoughts from the more traditional form of DesignOps (designers working in tech-heavy companies), plus a collection of tools to help collaboration between designers.</p>\n<p>The term <a href=\"https://airbnb.design/designops-airbnb/\">was originally coined by the design team at Airbnb</a> with the intention of defining how to design iteratively and at scale, emulating their development brothers and sisters.</p>\n<hr>\n<p><em>“Tracking changes to code is straightforward. What about design?” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22Tracking+changes+to+code+is+straightforward.+What+about+design%3F%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/what-is-designops/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Design Components</h2>\n<p>For those designers that work mainly with web technologies, then design components are a familiar existing practice that emulate similar workflows that development teams follow. Such practice makes it easier for designers to share their efforts with development teams and makes it more likely that they use those components.</p>\n<p><a href=\"https://bradfrost.com/blog/post/atomic-web-design/\">Brad Frost</a> coined the term “atomic design” that describes how to break page designs down into components. He and was one of the first to look at how designers can design in ways that better complement modern application design.</p>\n<p>Libraries such as <a href=\"https://getbootstrap.com/\">Bootstrap</a> and <a href=\"https://material.io/guidelines/\">Material Design</a> helped solidify this practice, and I assume that <a href=\"https://sketchapp.com/\">Sketch</a> brought the concept to a design tool. Practically speaking, companies then typically create their visual languages and style guides based on these components. Good reference examples are the <a href=\"https://airbnb.design/building-a-visual-language/\">“Building a Visual Language”</a> article from Airbnb, the <a href=\"https://atlaskit.atlassian.com/\">Atlassian design kit</a>, and <a href=\"https://github.com/alexpate/awesome-design-systems\">further inspirations here</a>.</p>\n<p>Implementing design components is a large and broad subject that depends on your preferred front-end technology. It’s an excellent area to engage your developers and get them excited about using or creating tooling suited to your use case. Scour GitHub or JavaScript blogs, and you find hundreds of repositories and guides to implementing design language and components in a variety of front-end frameworks.</p>\n<h2>Sharing Assets and Components</h2>\n<p>Designers are (in a sweeping generalization) visual people, so as you might expect, they would rather see, use, and share design components more visually. Unsurprisingly, the tools to support this are burgeoning.</p>\n<p><a href=\"https://uxdesign.cc/shared-libraries-which-one-to-use-f89f20d4eaef\">This post by Audrey Hacq</a> summarizes the current big four options for Sketch. These are <a href=\"https://www.invisionapp.com/craft\">Craft</a>, <a href=\"https://www.lingoapp.com/\">Lingo</a>, <a href=\"https://zeroheight.com/product\">zeroheight</a>, and <a href=\"https://sketchapp.com/docs/libraries/shared-libraries\">Sketch’s shared libraries</a>. They all work in similar ways, with some offering permissions, but none offer versioning.</p>\n<p>As these are for Sketch, again, they are primarily for web and app components, but you could use them for other purposes with some creative thinking.</p>\n<h3>Non-web projects</h3>\n<p>Some of the tools listed above export components for iOS and Android, which also represent their visual assets as code/text. For example, Android uses XML files, and while I know everyone hates XML, it’s easier to see and track changes to the files. Likewise, iOS development maintains layout files separately and allows for similar tracking.</p>\n<h3>Not using Sketch</h3>\n<p>As a tool designed and built for modern application development, Sketch has some of the best features when it comes to asset sharing, but there are options for other applications and standalone.</p>\n<p><a href=\"https://www.figma.com/\">Figma</a> has a great feature set including versioning, export to different platforms and formats, plus workflows and tools that suit multiple team roles.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/03/do-figma.png\" alt=\"\" width=\"1221\" height=\"957\" class=\"size-full wp-image-6241\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-figma.png 1221w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-figma-300x235.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-figma-768x602.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-figma-510x400.png 510w\" sizes=\"(max-width: 1221px) 100vw, 1221px\"><p class=\"wp-caption-text\">Figma</p>\n</div>\n<p>When it comes to design work, I mostly use Adobe products. Creative Cloud has a <a href=\"https://helpx.adobe.com/creative-cloud/help/share.html\">shared library</a>, but I have found it fiddly, and it lacks features, such as exporting and versioning.</p>\n<p>For open source aficionados, there’s <a href=\"https://identihub.co/\">Identihub</a>. It’s a new project and so lacks advanced features such as versioning and export for web and mobile platforms. But it’s free and works well for collaboration between smaller teams.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/03/do-identihub.png\" alt=\"\" width=\"1233\" height=\"822\" class=\"size-full wp-image-6242\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-identihub.png 1233w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-identihub-300x200.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-identihub-768x512.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-identihub-600x400.png 600w\" sizes=\"(max-width: 1233px) 100vw, 1233px\"><p class=\"wp-caption-text\">Identihub</p>\n</div>\n<p><a href=\"https://www.invisionapp.com/\">InVision</a> (which also creates the Craft shared library above) focus more on a complete solution for design collaboration, and their forthcoming <a href=\"https://www.invisionapp.com/studio\">“studio”</a> tool looks promising. I am personally reticent to do everything in the browser, which puts me off using it too much. Functionality includes versioning, discussion, exporting, and device previews.</p>\n<p><a href=\"https://zeplin.io/\">Zeplin</a> is a handy little tool that generates style guides and code snippets from the assets you upload from Sketch, Adobe XD CC, Figma, and Photoshop CC designs. <a href=\"https://sympli.io/\">Sympli</a> is similar, but adds more features and direct integration with the tools designers and developers are already using, for example, a direct connection between Photoshop and XCode.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/03/do-zeplin.png\" alt=\"\" width=\"1257\" height=\"665\" class=\"size-full wp-image-6243\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-zeplin.png 1257w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-zeplin-300x159.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-zeplin-768x406.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-zeplin-756x400.png 756w\" sizes=\"(max-width: 1257px) 100vw, 1257px\"><p class=\"wp-caption-text\">Zeplin</p>\n</div>\n<h2>Binary Files</h2>\n<p>Great, but what about actual binary files, images, audio, etc.? Is it possible to collaborate on those? Of course, there’s nothing stopping you using file sync platforms such as Dropbox or OneDrive. All these give you rudimentary version control, <em>ie</em>, you can revert to previous versions, but they don’t recognize subtle changes or show you what’s different.</p>\n<p>This feature has been a dream for years, and now versioning tools can handle this.</p>\n<p><a href=\"https://help.github.com/articles/rendering-and-diffing-images/\">GitHub</a> has an image diffing tool that lets you compare different versions, but it doesn’t show you what the differences are. However, using the four different display options, you can probably work out the changes yourself.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/03/images-swipe-view.png\" alt=\"\" width=\"1860\" height=\"2026\" class=\"size-full wp-image-6244\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/images-swipe-view.png 1860w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/images-swipe-view-275x300.png 275w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/images-swipe-view-768x837.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/images-swipe-view-367x400.png 367w\" sizes=\"(max-width: 1860px) 100vw, 1860px\"><p class=\"wp-caption-text\">GitHub image diff</p>\n</div>\n<p><a href=\"https://docs.gitlab.com/ee/user/discussions/#image-discussions\">GitLab</a> has similar features plust the ability to add comments to particular areas of an image, which is pretty awesome.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/03/image_resolved_discussion.png\" alt=\"\" width=\"1930\" height=\"1112\" class=\"size-full wp-image-6245\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/image_resolved_discussion.png 1930w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/image_resolved_discussion-300x173.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/image_resolved_discussion-768x442.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/image_resolved_discussion-694x400.png 694w\" sizes=\"(max-width: 1930px) 100vw, 1930px\"><p class=\"wp-caption-text\">GitLab image diff</p>\n</div>\n<p>Many visual VCS clients allow you to compare image diffs, such as <a href=\"https://www.scootersoftware.com/index.php\">Beyond Compare</a>.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/03/do-beyond-compare.png\" alt=\"\" width=\"1115\" height=\"838\" class=\"size-full wp-image-6246\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-beyond-compare.png 1115w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-beyond-compare-300x225.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-beyond-compare-768x577.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/03/do-beyond-compare-532x400.png 532w\" sizes=\"(max-width: 1115px) 100vw, 1115px\"><p class=\"wp-caption-text\">Beyond Compare image diff</p>\n</div>\n<p>If you’re feeling bold, then <a href=\"https://www.imagemagick.org/script/compare.php\">ImageMagick</a> has a compare feature that creates an image highlighting the differences between two images. Now, this sounds like something that you could hook up to a CI tool…</p>\n<h2>It’s Not About Tools</h2>\n<p>If you’ve read this far, you’ve probably realized that DesignOps isn’t really about tooling as much as, say DevOps. It’s more about practices. In fact, in <a href=\"https://medium.com/@kaelig/introducing-design-systems-ops-7f34c4561ba7\">Kaelig’s seminal post “Design Systems Ops”</a>, he references DesignOps as people, not tools.</p>\n<blockquote>\n<p>A Design Systems Ops is a person who is part of a design systems team, who needs to get into the designers’ shoes and have a feel for what they are trying to conceptualize. At the same time, Design Systems Ops needs to understand the engineering requirements and define methods that will help shipping and scaling the design system. In a way, a Design Systems Ops is the translator between these two worlds.</p>\n</blockquote>\n<p>What do you think? Is DesignOps a practice worth taking further into creating concrete tools and practices, or part of our industry’s desire to give everything a catchy name when it doesn’t need one? I’d love to hear from you below!</p>\n<hr>\n<p><em>“What Is DesignOps?” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22What+Is+DesignOps%3F%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/what-is-designops/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/what-is-designops/\">What Is DesignOps?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"DevOps"
            ]
        },
        {
            "title": "Embracing the Chaos of Chaos Engineering",
            "pubDate": "2018-02-22 16:15:44",
            "link": "https://blog.codeship.com/embracing-the-chaos-of-chaos-engineering/",
            "guid": "https://blog.codeship.com/?p=6148",
            "author": "Chris Ward",
            "thumbnail": "",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span>Modern applications are increasingly growing in complexity. Adding a dizzying amount of moving parts, layers of abstraction, reliance on external systems and distribution that all result in a stack that few truly fully understand. Any developer worth hiring now knows the merits of a thorough testing regime, but one of the issues with testing is […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/embracing-the-chaos-of-chaos-engineering/\">Embracing the Chaos of Chaos Engineering</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span><p>Modern applications are increasingly growing in complexity. Adding a dizzying amount of moving parts, layers of abstraction, reliance on external systems and distribution that all result in a stack that few truly fully understand.</p>\n<p>Any developer worth hiring now knows the merits of a thorough testing regime, but one of the issues with testing is that you are often testing for predictable outcomes. Despite our ‘logical systems,’ show-stopping issues are typically unexpected; situations that no one foresaw.</p>\n<p>These unforeseen eventualities are what chaos engineering attempts to account for. It’s a reasonably new principle, practiced by Netflix for several years and then formalized in 2015, setting out <a href=\"https://principlesofchaos.org/\">its principles</a> in a time-honored manifesto.</p>\n<p>Naturally, there are critics of the practice, and the comments at the bottom of <a href=\"https://techcrunch.com/2018/02/04/the-rise-of-chaos-engineering/\">this TechCrunch article</a> summarize some of them. The typical counterarguments are that the principle is a band-aid for applications that were poorly planned and architected in the first place, or that it’s another buzzword-laden excuse to invent shiny new tools that no one knew they needed.</p>\n<p>Still, it’s proponents are a friendly bunch, so in this article, I summarize my findings on the practice and let you decide.</p>\n<hr>\n<p><em>“Unforeseen eventualities are what chaos engineering attempts to account for.” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22Unforeseen+eventualities+are+what+chaos+engineering+attempts+to+account+for.%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/embracing-the-chaos-of-chaos-engineering/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Organized Chaos</h2>\n<p>In many ways, while the term ‘chaos’ is a good eye-catching phrase, it’s misleading, summoning images of burning servers and hapless engineers running around an office screaming. A better term is <em>experimental engineering</em>, but I agree that is less likely to get tech blog or conference attention.</p>\n<p>The core principles of chaos engineering follow similar lines to those you followed in school or university science classes:</p>\n<ol>\n<li>Form a hypothesis.</li>\n<li>Communicate to your team.</li>\n<li>Run experiments.</li>\n<li>Analyze the results.</li>\n<li>Increase the scope.</li>\n<li>Automate experiments.</li>\n</ol>\n<p>Early in the lifetime of chaos engineering at Netflix, most engineers thought chaos engineering was about “breaking things in production,” and it is in part. But while breaking things is great fun, it’s not a useful activity unless you learn something from it.</p>\n<p>These principles encourage you to introduce real-world events and events you expect to be able to handle. I wonder if fully embracing the “chaos” might result in more interesting results, <em>ie</em>, measuring the worst that could happen. True randomness and extremity could surface even more insightful results and observations.</p>\n<p>Let’s look at each of these steps in more detail.</p>\n<h3>1 – Form a hypothesis</h3>\n<p>To begin, you want to make an educated guess about what will happen in which scenarios. The key word here is “educated”; you need to gather data to support the hypothesis that you’ll share with your team.</p>\n<p><strong>Decide on your steady state</strong></p>\n<p>What is “steady” depends on your application and use case, but decide on a set of metrics that are important to you and what variance in those metrics is acceptable. For example:</p>\n<ul>\n<li>When completing checkout, the majority of customers should have a successful payment processed.</li>\n<li>Users should experience latency below a particular rate.</li>\n<li>A process should complete within a time frame.</li>\n</ul>\n<p>When deciding on these metrics, also consider external factors such as SLAs and KPIs for your team or product(s).</p>\n<p><strong>Introduce real-world events</strong></p>\n<p>The sorts of events to test vary depending on your use case, but common to most applications are:</p>\n<ul>\n<li>Hardware/VM failure</li>\n<li>State inconsistency</li>\n<li>Running out of CPU, memory, or storage space</li>\n<li>Dependency issues</li>\n<li>Race conditions</li>\n<li>Traffic spikes</li>\n<li>Service unavailability</li>\n</ul>\n<p><strong>Run in production</strong></p>\n<p>“Testing in production” has long been a tongue-in-cheek reference to an untested code base, but as chaos engineering is likely run in collaboration with a properly pre-tested code base, it takes on a different meaning.</p>\n<p>The principles we’re working with here encourage you to undertake tests in production, or if you have a genuine reason for not doing so, as close as possible. Chaos engineering principles are designed to identify weakness, so they argue that running in production is fundamentally a good thing.</p>\n<p><a href=\"https://www.itnews.com.au/news/nab-deploys-chaos-monkey-to-kill-servers-24-7-382285\">Some banks are already following these principles</a>, and while engineers behind safety-critical systems should be confident of their setup before embarking on chaos engineering, the principles also recommend you design each experiment to have minimal impact and ensure you can abort at any time.</p>\n<p><strong>Metrics</strong></p>\n<p>While the most tempting hypothesis is “let’s see what happens” (much like “let’s just break things”), it’s not a constructive one. Try to concoct a hypothesis based on your steady state, for example:</p>\n<ul>\n<li>If PayPal is unavailable, successful payments will drop by 20 percent.</li>\n<li>During high traffic, latency will increase by 500ms.</li>\n<li>If an entire AWS region is unavailable, a process will take 1 second longer to complete.</li>\n</ul>\n<h3>2 – Communicate to your team</h3>\n<p>As a technical communicator, this is perhaps the most important step to me. If you have a team of engineers running experiments on production systems, then relevant people (if not everyone) deserve to know. It’s easy to remember engineers, but don’t forget people who deal with the public, too, such as support and community staff who may start receiving questions from customers.</p>\n<h3>3 – Run your experiments</h3>\n<p>The way you introduce your experiments varies, some from code deployments, others by injecting calls you know will fail, or simple scripts. There are myriad tools available to help simulate these; I’ve provided links to find them below.</p>\n<p>Make sure you have alerting and reporting in place to stop an experiment if needed, but also to analyze results later.</p>\n<h3>4 – Analyze the results</h3>\n<p>There’s no point in running an experiment if you don’t take time to reflect on what data you gathered and to learn from it. There are many tools you probably already use to help with this stage, but make sure you involve input from any teams whose services were involved in the experiment.</p>\n<h3>5 – Increase the scope</h3>\n<p>After defining your ideal metrics and the potential effects on them, it’s time to start testing your hypothesis. Much like other aspects of modern software development, be sure to iterate these events, changing parameters or the events you test for.</p>\n<p>Once you’ve tried one experiment, learned from it, and potentially fixed issues it identified, then move on to the next one. This may be introducing a new experiment or increasing the metrics of an existing one to find out where a system really starts to break down.</p>\n<h3>6 – Automate the experiments</h3>\n<p>The first time(s) you run an experiment, manually is fine — you can monitor the outcome and abort it if necessary. But you should (especially with teams that follow continuous deployment) automate your experiments as quickly as possible. This means that the experiment can run when new factors are introduced into an application, but it also makes it easier to change input parameters for the scope of your experiments.</p>\n<p>Again, the resources section below lists places to find tools to help with this.</p>\n<h2>Quietly Chaotic</h2>\n<p>While engineers and developers are divided on the usefulness of chaos engineering, the most interesting aspects to me are not the technical ones, but rather that it tests and checks ego.</p>\n<p>The principles state in many places that if you are truly confident in your application, then you shouldn’t fear what it proposes. They force you to put your money where your mouth is and (albeit in a careful and controlled way) prove your application is as confident as you are. I can imagine many insightful debriefing sessions after a chaos engineering experiment.</p>\n<h2>Tools and Resources</h2>\n<ul>\n<li>The free <a href=\"https://www.oreilly.com/webops-perf/free/chaos-engineering.csp\">O’Reilly book on Chaos Engineering</a>\n</li>\n<li>\n<a href=\"https://github.com/dastergon/awesome-chaos-engineering\">The comprehensive Chaos Engineering</a> awesome list that features a plethora of useful tools and resources</li>\n<li>The <a href=\"https://chaos.community/\">Chaos Community</a>, <a href=\"https://groups.google.com/forum/#!forum/chaos-community\">Mailing List</a> and <a href=\"https://www.meetup.com/pro/chaos/\">Meetups</a>\n</li>\n<li>\n<a href=\"https://www.gremlin.com/index.html\">Gremlin</a>, whose staff are often behind a lot of the Netflix-independent chaos engineering resources, runs a ‘Failure-as-a-service’ platform that commoditizes many of the tools and practices featured in this post</li>\n</ul>\n<hr>\n<p><em>“Embracing the Chaos of Chaos Engineering” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22Embracing+the+Chaos+of+Chaos+Engineering%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/embracing-the-chaos-of-chaos-engineering/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/embracing-the-chaos-of-chaos-engineering/\">Embracing the Chaos of Chaos Engineering</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"DevOps"
            ]
        },
        {
            "title": "A Roundup of Managed Kubernetes Platforms",
            "pubDate": "2018-02-01 16:15:57",
            "link": "https://blog.codeship.com/a-roundup-of-managed-kubernetes-platforms/",
            "guid": "https://blog.codeship.com/?p=6078",
            "author": "Chris Ward",
            "thumbnail": "https://blog.codeship.com/wp-content/uploads/2018/02/mk-azure.jpg",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">7</span><span class=\"rt-label\"> minutes</span></span>In the race of container orchestrators, Kubernetes is surging ahead. But much like when I wrote my post on Docker hosting, people are often stuck on the step of getting their infrastructure to production. Unlike when I first wrote that, the industry has progressed massively, and as you will see, I found a lot of […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/a-roundup-of-managed-kubernetes-platforms/\">A Roundup of Managed Kubernetes Platforms</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">7</span><span class=\"rt-label\"> minutes</span></span><p>In the race of container orchestrators, Kubernetes is surging ahead. But much like when I wrote my post on <a href=\"https://blog.codeship.com/the-shortlist-of-docker-hosting\">Docker hosting</a>, people are often stuck on the step of getting their infrastructure to production. Unlike when I first wrote that, the industry has progressed massively, and as you will see, I found a lot of companies willing to offer you solutions for helping you get Kubernetes into production.</p>\n<p>My criteria for inclusion in this article was companies that let me try their service easily. I excluded anyone with a ‘contact us for a trial’ or ‘contact us for more information’ button, and I wanted to see what they offered myself.</p>\n<p>To reduce repetition, pretty much every provider offers all the base features <a href=\"https://kubernetes.io/\">Kubernetes</a> offers, plus constant updates.</p>\n<hr>\n<p><em>“Current and future solutions for getting Kubernetes into production” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22Current+and+future+solutions+for+getting+Kubernetes+into+production%22+via+%40chrischinch&amp;url=https://blog.codeship.com/a-roundup-of-managed-kubernetes-platforms/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Google Cloud Platform (GCP)</h2>\n<p>I would hazard a guess that GCP was never that high on people’s list for a cloud provider until Google released Kubernetes. It’s reasonable that the best-managed option would originate from the company behind the birth of the project.</p>\n<p>The <a href=\"https://cloud.google.com/kubernetes-engine/\">GCP Kubernetes engine</a> offers similar integration with other GCP products, much like many of the other large cloud providers in this article. In GCP’s case, this includes:</p>\n<ul>\n<li>Authentication and access rights</li>\n<li>Logging and monitoring</li>\n<li>Hybrid networking</li>\n<li>A <a href=\"https://cloud.google.com/container-optimized-os/\">custom container-optimized OS</a>\n</li>\n<li>Private image repositories and image builder</li>\n</ul>\n<h2>AKS (Azure)</h2>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-azure.jpg\" alt=\"\" width=\"1280\" height=\"835\" class=\"size-full wp-image-6080\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-azure.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-azure-300x196.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-azure-768x501.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-azure-613x400.jpg 613w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">Microsoft Azure</p>\n</div>\n<p><a href=\"https://azure.microsoft.com/en-us/services/container-service/\">Microsoft’s Azure Container Service</a> (curiously called ‘AKS’) is in public preview, so it’s not recommended you use it in production, but it should be good enough to evaluate. It supports:</p>\n<ul>\n<li>Multiple Kubernetes versions</li>\n<li>Switching between Docker, DC/OS, and Kubernetes orchestration at will; the crucial factor is running containers</li>\n<li>Integration with the Azure <a href=\"https://azure.microsoft.com/en-us/services/container-registry/\">container registry</a>, container monitoring solution</li>\n<li>Access to all the Kubernetes APIs and toolchain via the <code>az</code> CLI tool or the Azure portal</li>\n</ul>\n<h2>Stackpoint</h2>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-stackpoint.jpg\" alt=\"\" width=\"907\" height=\"741\" class=\"size-full wp-image-6081\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint.jpg 907w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-300x245.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-768x627.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-490x400.jpg 490w\" sizes=\"(max-width: 907px) 100vw, 907px\"><p class=\"wp-caption-text\">Stackpoint</p>\n</div>\n<p><a href=\"https://stackpoint.io/\">Stackpoint</a> helps you install and manage a Kubernetes cluster hosted with AWS, GCE, Azure, and Digital Ocean. The setup process is quick and straightforward, and Stackpoint has a library of preconfigured images straight to your cluster during the setup phase, and from a graphical interface once the cluster is running.</p>\n<p>Stackpoint provides their own GUI to access high-level details and links to the default Kubernetes GUI and <code>kubectl</code> tool for everything else. </p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-stackpoint-dashboards.png\" alt=\"\" width=\"2168\" height=\"643\" class=\"size-full wp-image-6082\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-dashboards.png 2168w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-dashboards-300x89.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-dashboards-768x228.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-stackpoint-dashboards-1349x400.png 1349w\" sizes=\"(max-width: 2168px) 100vw, 2168px\"><p class=\"wp-caption-text\">Stackpoint dashboards</p>\n</div>\n<h2>AppsCode</h2>\n<p>I’m sneaking <a href=\"https://appscode.com/\">AppsCode</a> into this list — while their cluster management solution lies behind a Request a Demo button, they also have a suite of open-source tools available for all sorts of Kubernetes-related tasks. And stringing some of them together, you can probably create similar solutions.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-appscode.png\" alt=\"\" width=\"1134\" height=\"991\" class=\"size-full wp-image-6083\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-appscode.png 1134w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-appscode-300x262.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-appscode-768x671.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-appscode-458x400.png 458w\" sizes=\"(max-width: 1134px) 100vw, 1134px\"><p class=\"wp-caption-text\">Appscode offerings</p>\n</div>\n<h2>Openshift</h2>\n<p><a href=\"https://www.openshift.com/\">Red Hat’s OpenShift</a> is one of the more veteran and comprehensive Kubernetes solutions, with a lot of development and community work from Red Hat thrown in for good measure. It’s a standalone Kubernetes distribution, adding dozens of developer- and ops-related tools to make using Kubernetes more productive.</p>\n<p>OpenShift comes in four varieties, and the names and differences are a little confusing, so hold on there:</p>\n<ul>\n<li>\n<a href=\"https://docs.openshift.org/latest/welcome/index.html\">OpenShift Origin</a>: the open-source, do-what-you-want upstream version</li>\n<li>OpenShift Enterprise that has its own sub-versions:\n<ul>\n<li>\n<a href=\"https://www.openshift.com/pricing/\">OpenShift Online</a>: on-demand and in a public cloud</li>\n<li>\n<a href=\"https://www.openshift.com/dedicated/\">OpenShift Dedicated</a>: a private, high-availability cluster, hosted on AWS or GCP but operated by Red Hat</li>\n<li>\n<a href=\"https://www.openshift.com/container-platform/\">OpenShift Container Platform</a>: an enterprise private PaaS in your data center or private cloud <div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-openshift.jpg\" alt=\"\" width=\"1173\" height=\"398\" class=\"size-full wp-image-6084\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-openshift.jpg 1173w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-openshift-300x102.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-openshift-768x261.jpg 768w\" sizes=\"(max-width: 1173px) 100vw, 1173px\"><p class=\"wp-caption-text\">OpenShift dashboard</p>\n</div>\n</li>\n</ul>\n</li>\n</ul>\n<p>Confused? Well, don’t worry too much about what version is right for you. Here’s a quick roundup of some of the features OpenShift brings to Kubernetes:</p>\n<ul>\n<li>Custom domain routing and software-defined network; an image library of prepackaged applications to install onto your cluster, checked and tested by Red Hat</li>\n<li>Integration with other Red Hat platforms such as JBoss and RHEL</li>\n<li>“Code and push” deployments from version control straight to running on a cluster</li>\n<li>Multiple environments and release management</li>\n<li>A GUI to access most functionality, a CLI tool, and integration with some (enterprise friendly IDEs)</li>\n</ul>\n<h2>IBM Cloud Container Service</h2>\n<p><a href=\"https://www.ibm.com/cloud/container-service\">IBM Cloud’s Kubernetes</a> offering is a simple affair, perfect for anyone looking for bare-bones Kubernetes cluster. You can access and manage your cluster through the default Kubernetes CLI and the IBM cloud CLI (for authentication and other IBM-specific tasks) and a basic GUI.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-ibm.jpg\" alt=\"\" width=\"1150\" height=\"449\" class=\"size-full wp-image-6085\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-ibm.jpg 1150w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-ibm-300x117.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-ibm-768x300.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-ibm-1024x400.jpg 1024w\" sizes=\"(max-width: 1150px) 100vw, 1150px\"><p class=\"wp-caption-text\">IBM Cloud</p>\n</div>\n<p>Much like some of the other cloud offerings in this list, using the IBM Cloud Container Service gives you easy integration with their other services, and in IBM’s case, the most tempting of these is the infamous Watson.</p>\n<h2>Ubuntu</h2>\n<p>Canonical offers <a href=\"https://www.ubuntu.com/kubernetes\">an Ubuntu-optimized version of Kubernetes</a> for simple deployment to AWS. It doesn’t add much to default Kubernetes beyond a simplified semi-graphical installation interface, but if you’re an existing user of the Ubuntu ecosystem, then you might find it a comfortable fit.</p>\n<h2>Containership</h2>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-containership.jpg\" alt=\"\" width=\"1118\" height=\"581\" class=\"size-full wp-image-6086\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-containership.jpg 1118w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-containership-300x156.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-containership-768x399.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-containership-770x400.jpg 770w\" sizes=\"(max-width: 1118px) 100vw, 1118px\"><p class=\"wp-caption-text\">Containership</p>\n</div>\n<p>I had featured <a href=\"https://containership.io/\">Containership</a> before in my Docker hosting roundup, when they were using a custom orchestrator, and they have also added support for Kubernetes. It works similarly to some of the other providers on this list, helping you create and manage multi-cloud infrastructures. However, it offers other providers not found on many others in this list such as Digital Ocean, Packet, and Linode.</p>\n<p>In addition to creation and management, Containership offers access to private image repositories, snapshotting your cluster and a preconfigured library of services to install to your cluster (again including lesser known options).</p>\n<h2>GoPaddle</h2>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-gopaddle.jpg\" alt=\"\" width=\"1166\" height=\"472\" class=\"size-full wp-image-6087\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-gopaddle.jpg 1166w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-gopaddle-300x121.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-gopaddle-768x311.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-gopaddle-988x400.jpg 988w\" sizes=\"(max-width: 1166px) 100vw, 1166px\"><p class=\"wp-caption-text\">GoPaddle dashboard</p>\n</div>\n<p>Taking a different but potentially confusing approach to managing your Kubernetes cluster, <a href=\"https://www.gopaddle.io/#/\">GoPaddle</a> uses a visual UML-style service designer that you then push to a provider. I don’t know how useful it is, but after reviewing so many dashboards and lists for this article, it was a refreshing change.</p>\n<p>Beyond this, GoPaddle offers the features you will find in many of the other services listed here, including authentication, logging, continuous integration, and with one additional bonus, support for Terraform templates.</p>\n<h2>Nirmata</h2>\n<p><a href=\"https://www.nirmata.com/\">Nirmata</a> offers the option to connect preexisting Kubernetes clusters, or have the platform set up a vanilla one for you. You can deploy your cluster to a variety of public and private clouds.</p>\n<p>It offers the typical authentication, logging and prepackaged images of many of the other options in this article, plus GUI-accessible resource policies and a simple dashboard view of cluster state(s).</p>\n<h2>Kubermatic</h2>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2018/02/mk-kubermatic.jpg\" alt=\"\" width=\"1169\" height=\"634\" class=\"size-full wp-image-6088\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-kubermatic.jpg 1169w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-kubermatic-300x163.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-kubermatic-768x417.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2018/02/mk-kubermatic-738x400.jpg 738w\" sizes=\"(max-width: 1169px) 100vw, 1169px\"><p class=\"wp-caption-text\">Kubermatic dashboard</p>\n</div>\n<p><a href=\"https://www.loodse.com/\">Kubermatic</a> offers deployment to AWS and Digital Ocean, with an easy-to-use GUI for creating and managing clusters with logging and metrics built in. Their core software is also open source, and they are one of the few European companies on this list 🇪🇺.</p>\n<h2>Joyent Triton</h2>\n<p><a href=\"https://www.joyent.com/\">Joyent</a> is one of a handful of the smaller companies steadily and successfully running cloud-native deployments for the past few years, so adding a Kubernetes offering is an obvious move. Similar to GoPaddle, Triton uses Terraform templates under the hood that you can change to suit your needs.</p>\n<p>Triton lets you install a cluster to their own public or private cloud, as well as GCP, AWS, VMWare, Azure, and your servers. The installation process is one of the more complicated on this list but leverages a lot of familiar DevOps tools, so may suit some of your existing workflows better.</p>\n<h2>Tectonic</h2>\n<p><a href=\"https://coreos.com/tectonic/\">Tectonic</a> from CoreOS takes a similar approach to Triton, using Teraform templates to deploy their take on Kubernetes to bare metal machines, AWS, or Azure. Naturally Tectonic runs CoreOS with all the benefits to Kubernetes and container-based applications that involves.</p>\n<p><span class=\"hs-cta-wrapper\"><span class=\"hs-cta-node hs-cta-964db6a6-69da-4366-afea-b129019aff07\">!Sign up for a free Codeship Account</span> </span></p>\n<h2>Chinese Clouds</h2>\n<p>I also came across a handful of large Chinese companies that had Kubernetes-based offerings that I couldn’t effectively test as I don’t speak any Chinese languages (I do hope to change that in 2018). While they often offer English language versions, typically once you were a few levels deep, the Chinese origins showed and I was confused. If you’re interested, here are the ones I found:</p>\n<ul>\n<li><a href=\"https://cloud.tencent.com/product/ccs\">Tencent Cloud</a></li>\n<li><a href=\"https://cn.aliyun.com/product/containerservice\">Alibaba</a></li>\n<li><a href=\"https://developer.huawei.com/ict/en/site-paas\">Huawei</a></li>\n</ul>\n<h2>In Early Access</h2>\n<p>I came across a handful of services that weren’t ready yet, but by the time you read this, they might be.</p>\n<h3>Pivotal Container Service</h3>\n<p>At the time of writing, <a href=\"https://pivotal.io/platform/pivotal-container-service\">Pivotal Container Service</a> was not yet publicly available, but if you are entrenched in the Pivotal/VMWare ecosystem, then it might be ready for you when you are.</p>\n<h3>Oracle Wercker</h3>\n<p><a href=\"https://www.wercker.com/\">Wercker</a> has two new services called Deploy and Operate planned that are for, you guessed it, deploying and operating Kubernetes clusters.</p>\n<h3>Amazon EKS</h3>\n<p>AWS is top of many developers’ lists when it comes to hosting, and they typically offer a solution for every need you might have. <a href=\"https://aws.amazon.com/eks/\">Their Kubernetes offering</a> is in an invite-only preview, so it’s hard to provide a comprehensive review. From what I can tell, it will offer features such as:</p>\n<ul>\n<li>Integration with the other myriad tools of AWS for load balancing, authentication, availability zones, service isolation, private network access, and logging</li>\n<li>Automatic updates, patching</li>\n<li>Access to the <code>kubectl</code> CLI</li>\n</ul>\n<h2>There Will Be More</h2>\n<p>And that’s it for now! I’m sure there are some I missed, so keep your suggestions coming in the comments.</p>\n<p><strong>PS:</strong> If you’re interested in learning more about Kubernetes you might be interested in this Codeship eBook: <a href=\"https://resources.codeship.com/ebooks/deploy-docker-kubernetes-codeship?utm_source=CodeshipBlog\">CD for Docker Apps to Kubernetes</a>.</p>\n<hr>\n<p><em>“A Roundup of Managed Kubernetes Platforms” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22A+Roundup+of+Managed+Kubernetes+Platforms%22+via+%40chrischinch&amp;url=https://blog.codeship.com/a-roundup-of-managed-kubernetes-platforms/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/a-roundup-of-managed-kubernetes-platforms/\">A Roundup of Managed Kubernetes Platforms</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"DevOps"
            ]
        },
        {
            "title": "Distributing Operational Knowledge Across a Team",
            "pubDate": "2017-12-28 16:15:58",
            "link": "https://blog.codeship.com/distributing-operational-knowledge-across-a-team/",
            "guid": "https://blog.codeship.com/?p=5949",
            "author": "Chris Ward",
            "thumbnail": "https://blog.codeship.com/wp-content/uploads/2017/12/communication_issues.png",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">9</span><span class=\"rt-label\"> minutes</span></span>I am sure we have all worked (or work) for companies, teams, or clients where communication of internal information is somewhere on the scale between nonexistent and abysmal. Despite constant advances in information storage and communication technology, I’m sure many of you would agree that we are still not any better at communicating with each […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/distributing-operational-knowledge-across-a-team/\">Distributing Operational Knowledge Across a Team</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">9</span><span class=\"rt-label\"> minutes</span></span><p>I am sure we have all worked (or work) for companies, teams, or clients where communication of internal information is somewhere on the scale between nonexistent and abysmal. Despite constant advances in information storage and communication technology, I’m sure many of you would agree that we are still not any better at communicating with each other. In this post, I will discuss some tooling options to consider, but more important, cover when, why, and how to use them.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/12/communication_issues.png\" alt=\"\" width=\"960\" height=\"560\" class=\"size-full wp-image-5970\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communication_issues.png 960w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communication_issues-300x175.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communication_issues-768x448.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communication_issues-686x400.png 686w\" sizes=\"(max-width: 960px) 100vw, 960px\"><p class=\"wp-caption-text\">Every organization has communication issues.</p>\n</div>\n<p><a href=\"https://en.wikipedia.org/wiki/Knowledge_management\">Knowledge management</a> is an entire role and sector in itself, and one with a lengthy history. Companies with employees that have this role are typically much larger, but there’s no reason smaller teams can’t adopt some of the same practices. In fact, a small or new team is often in a better place to affect change as you have less baggage and inertia.</p>\n<hr>\n<p><em>“Knowledge management isn’t just a concern for larger companies.” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22Knowledge+management+isn%E2%80%99t+just+a+concern+for+larger+companies.%22+via+%40chrischinch&amp;url=https://blog.codeship.com/distributing-operational-knowledge-across-a-team/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Tools</h2>\n<p>Many tools can, in theory, fit into the category of ‘knowledge management,’ and listing them all would be a long and tedious article to write and read. Instead, I will introduce the principles of tools, mention the most popular, and then point you in the direction of where to find lists of options to consider.</p>\n<h3>Task managers</h3>\n<p>A task management tool varies in complexity from more straightforward options such as a shared ‘To Do’ lists that mark a task as done or not, to customized issue tracking software with multiple projects and access levels.</p>\n<p>At the simpler end are tools like <a href=\"https://www.wunderlist.com/\">Wunderlist</a> or <a href=\"https://keep.google.com/u/0/\">Keep</a>, and I recommend you read this <a href=\"https://www.theguardian.com/technology/2016/apr/20/seven-of-the-best-to-do-list-apps\">Guardian article</a> for a round-up of seven to consider. These tools don’t allow for much discussion on tasks, or for handing tasks backward and forwards, but for smaller teams with concrete and obvious tasks, they can be more than enough.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/12/todos.png\" alt=\"\" width=\"960\" height=\"560\" class=\"size-full wp-image-5971\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/todos.png 960w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/todos-300x175.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/todos-768x448.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/todos-686x400.png 686w\" sizes=\"(max-width: 960px) 100vw, 960px\"><p class=\"wp-caption-text\">Making to dos doesn’t make you any better at completing them.</p>\n</div>\n<p><a href=\"https://trello.com/\">Trello</a> firmly occupies the middle ground of task management tools, but it also has many alternatives, and I recommend this <a href=\"https://www.quora.com/What-are-the-best-alternative-apps-with-mobile-support-to-Trello\">Quora thread</a> to find some options to consider. These tools typically offer multiple user accounts with differing levels of access, different projects, a degree of discussion on each task, task statuses, and integration with other services.</p>\n<p>At the higher end is the tool that everyone loves to hate, <a href=\"https://www.atlassian.com/software/jira\">Jira</a>, and it has plenty of alternatives you can find in this <a href=\"https://www.workzone.com/blog/jira-alternatives/\">workzone post</a> or on <a href=\"https://alternativeto.net/software/jira/\">alternative.to</a>. These tools allow for in-depth discussions around issues, complex categorizing of issues, a lot of integration options and white-labeling for your business or project. Depending on which option you choose, configuration options are almost endless, and this is one of the issues with this level of tools, they often require a more significant time investment for setup and daily usage, which can lead to abandonment if you’re not careful.</p>\n<h3>Knowledge repositories</h3>\n<p>Task management tools help teams communicate tasks with some form of deadline and (typically) minimal discussion. For information that you need in the longer term, or that requires more content than is usually readable in a comment, you will need other tools. These can vary from shared documents in a folder to complex wiki tools. This area of tooling is not as clear-cut as with task managers, as tools have more gray areas between the functionality they offer. It’s also a tooling area that has existed for a lot longer, and so there are more modern takes on an older idea, which grays the lines even more.</p>\n<p>Creating a shared folder on a networked drive and storing documents for team members to refer to and collaborate on is not a new practice, but the options for sharing a drive have. Among dozens of cloud-based options, <a href=\"https://dropbox.com/\">Dropbox</a> is the most popular, but <a href=\"https://beebom.com/dropbox-altenatives-cloud-storage-services/\">there are many more</a>, and also <a href=\"https://alternativeto.net/software/dropbox/\">options that you can also self-host</a>. If you want to keep your options more traditional and use a shared volume on your local network, then options vary depending on what varieties of Windows, macOS or Linux you are running, but it is possible.</p>\n<p>It’s worth noting that not all the options mentioned above are truly collaborative. For example, Dropbox is for sharing; if two of you work on a file (locally) at the same time, you will create a file conflict. However, with other options, such as Google docs, you can edit files in a browser window, collaboratively seeing the changes everyone is making in real time. For those more technically minded of you who are up for a challenge, another great option is using version control such as <a href=\"https://guides.github.com/activities/hello-world/\">Git and GitHub</a>. There is a small learning curve, but it gives you fine-grained collaboration that few of the other options provide.</p>\n<p>Wikis are also not a new technology, and their popularity rises and falls. Wikis allow for collaborative creation and editing of information, typically rendered as a web page. Depending on how you setup permissions, they enable users to create content they feel is missing, and suggest edits to other content. If rendered as a web page, you can embed other forms of media into a wiki such as images and video that can help clarify complex topics. <a href=\"https://www.atlassian.com/software/confluence\">Confluence</a> is one of the more popular commercial options, but <a href=\"https://alternativeto.net/software/confluence/\">there are many others to choose from</a>, including a lot of open source alternatives.</p>\n<h3>Communications</h3>\n<p>Companies and projects that are attempting to ‘disrupt email’ have grown at a rate almost comparable to JavaScript frameworks and databases. I will address the more systemic issues behind knowledge exchange later in this article that led to this desire, but most communications tools are similar in the way they attempt to “fix it.”</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/12/over_communication.png\" alt=\"\" width=\"960\" height=\"560\" class=\"size-full wp-image-5972\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/over_communication.png 960w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/over_communication-300x175.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/over_communication-768x448.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/over_communication-686x400.png 686w\" sizes=\"(max-width: 960px) 100vw, 960px\"><p class=\"wp-caption-text\">Too much communication can be a bad thing.</p>\n</div>\n<p>These tools allow users to create “channels” or discussions around particular topics and also message individual users. On top of this are user roles and permissions, notification preferences and integration with other tools. <a href=\"https://slack.com/\">Slack</a> has been the recent success story, but this is also not a new field of tooling, and there are also a lot of <a href=\"https://www.workzone.com/blog/slack-alternatives/\">commercial</a> and <a href=\"https://opensource.com/alternatives/slack\">open source</a> alternatives. The main differences between the platforms come in usability and features vs. price; you pick what works for you.</p>\n<h3>CRMs</h3>\n<p>Customer/Client/Constituent Relationship Management tools (CRMs) are often part of an attempt to unify many of the tools included in this article so far and add much more besides. CRMs are often by nature complex tools that need setup and configuration, and you often don’t need to use one as soon as you think. CRMs focus on whatever the ‘C’ stands for to you and your interactions with them. Depending on your configuration, you can track communications, memberships, sales, tasks, meetings and much more. They are people-centered, and if your project doesn’t revolve around interactions with people, then they are also probably not necessary for you.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/12/crm.png\" alt=\"\" width=\"960\" height=\"560\" class=\"size-full wp-image-5973\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/crm.png 960w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/crm-300x175.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/crm-768x448.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/crm-686x400.png 686w\" sizes=\"(max-width: 960px) 100vw, 960px\"><p class=\"wp-caption-text\">A CRM focuses on a person.</p>\n</div>\n<p><a href=\"https://salesforce.com/\">Salesforce</a> is one of the biggest players in this space, and while the name indicates its popularity among sales teams, people use it in other contexts. CRMs are BIG business, and thus, there are a lot of <a href=\"https://alternativeto.net/software/salesforcecom/?license=commercial\">commercial</a> and <a href=\"https://alternativeto.net/software/salesforcecom/?license=opensource\">open source</a> alternatives. I used to contribute to and implement an open source CRM, and it’s worth noting that they can require a lot of initial resources to get started with and customize them in the future.</p>\n<p><span class=\"hs-cta-wrapper\"><span class=\"hs-cta-node hs-cta-964db6a6-69da-4366-afea-b129019aff07\">!Sign up for a free Codeship Account</span> </span></p>\n<h2>Practices</h2>\n<p>Picking tools is easy, getting people to use them is the hard part. I have spent time in companies attempting to get people to use tooling, and to use it correctly, and it’s a particular bugbear and passion of mine. Good communications and usage of tools help people understand where to find what they need, it keeps everyone informed of progress and in the long run should save time wasted repeating questions that already have answers. However, we have all worked in companies where typical responses are instead “just send me an email,” “Oh, I never use tool X,” “I couldn’t find an answer to X,” “I didn’t put it in the calendar” etc. In my opinion, getting people to use tooling is a paired ‘carrot’ and ‘stick’ approach.</p>\n<h3>The carrot – make them usable and relevant</h3>\n<p>It may sound obvious, but in so many cases people don’t use a tool because they haven’t received any training in using it, it’s not set up to suit their workflow or the barrier to using it is too high. I remember working at an organization that paid thousands each month for a <a href=\"https://products.office.com/en-us/sharepoint/collaboration\">SharePoint</a> (document collaboration) installation, but everyone used Google Docs because they found it easier to use.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/12/communicate_carrot.png\" alt=\"\" width=\"960\" height=\"560\" class=\"size-full wp-image-5974\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_carrot.png 960w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_carrot-300x175.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_carrot-768x448.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_carrot-686x400.png 686w\" sizes=\"(max-width: 960px) 100vw, 960px\"><p class=\"wp-caption-text\">Encourage people to communicate better.</p>\n</div>\n<p>If you are working for an older company with established work practices, run a research survey to assess what people are using for their work, and where their pain-points are. If you don’t address these pain-points (or worse, create a new process that is <em>harder</em>), then there’s a high likelihood that your tool roll-out will fail.</p>\n<h3>The stick – there is no choice</h3>\n<p>While what I posted above is an ideal, I’m sure anyone who has had any involvement with creating an application designed for multiple use cases knows that balancing the workflows and needs of everyone is impossible, so there also needs to be an element of ‘gentle encouragement.’ Often inter-person and inter-team collaboration need you to define some standards and commonality; if everyone can work the way they want, it results in chaos. You may need to define expectations and force usage of particular tools for particular work, i.e., “We only handle issues that are logged in Jira.” You may need to take these guidelines further by also defining communication guidelines around style, clarity, language and response times. After all, a team logging information that no-one pays any attention to is still wasting its time.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/12/communicate_stick.png\" alt=\"\" width=\"960\" height=\"560\" class=\"size-full wp-image-5975\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_stick.png 960w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_stick-300x175.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_stick-768x448.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/12/communicate_stick-686x400.png 686w\" sizes=\"(max-width: 960px) 100vw, 960px\"><p class=\"wp-caption-text\">Force people to communicate.</p>\n</div>\n<p>There’s a fine line to tread between lack of and too much communication. Finding that signal-to-noise ratio that suits your company or team culture will take time and also vary from country to country and person to person. I would say start with communicating too much and filter out what you realize isn’t needed. Starting the other way around could result in “not knowing what you don’t know.”</p>\n<h3>Talk to the face</h3>\n<p>In all this discussion of tooling, and especially in how it can help distributed teams operate, it’s easy to forget the lasting importance of face-to-face contact. While in some organizations and people, the quantity of meetings you have has almost become a badge of honor, the occasional meeting (in person or via VoIP) can be essential for clarifying assumptions, dedicating time to resolving specific issues, and building team morale. For example, a common trend in modern businesses is to have a daily standup, a short meeting where the whole team discusses what they have been working on, what they will work on, and any blocks they have to accomplish this. With teams spread around time zones this meeting might need to be asynchronous, or at different times to allow for a fair spread of times for the whole team.</p>\n<p><final_image></final_image></p>\n<p>As engineers, or working for engineering-focused companies, we have the tendency to get distracted by tooling and the latest shiny gadget or application that will solve <strong>all</strong> our problems. Whatever tool you use for communication or collaboration is enhancing a human practice, and any processes improvement project that ignores this is doomed to fail. Ignore the person at your peril.</p>\n<hr>\n<p><em>“Distributing Operational Knowledge Across a Team” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22Distributing+Operational+Knowledge+Across+a+Team%22+via+%40chrischinch&amp;url=https://blog.codeship.com/distributing-operational-knowledge-across-a-team/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/distributing-operational-knowledge-across-a-team/\">Distributing Operational Knowledge Across a Team</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"Industry"
            ]
        },
        {
            "title": "Going Serverless? Compare Your FaaS Options",
            "pubDate": "2017-11-29 16:15:34",
            "link": "https://blog.codeship.com/going-serverless-compare-your-faas-options/",
            "guid": "https://blog.codeship.com/?p=5828",
            "author": "Chris Ward",
            "thumbnail": "https://blog.codeship.com/wp-content/uploads/2017/11/faas-gcp.png",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span>As is typical with new concepts and technologies, the absolute definition of “serverless” or FaaS (Functions as a Service) is broad and undefined. In essence, it is a concept that takes cloud computing and “convenience as a service” to the extreme, spinning up processing power when your application needs it and responding with data. Serverless […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/going-serverless-compare-your-faas-options/\">Going Serverless? Compare Your FaaS Options</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span><p>As is typical with new concepts and technologies, the absolute definition of “serverless” or FaaS (Functions as a Service) is broad and undefined. In essence, it is a concept that takes cloud computing and “convenience as a service” to the extreme, spinning up processing power when your application needs it and responding with data.</p>\n<p>Serverless is perfect for IoT devices, microservice architectures, or any other application that needs to be efficient. In this article, I will look beyond the major players (AWS, Azure, Google) to highlight lesser-known contenders for you to consider for your next project.</p>\n<p>Many share similarities and features, some are container-based, some open source (requiring setup on your part), and some don’t describe themselves as “serverless” but share enough conceptual similarities I included them anyway.</p>\n<hr>\n<p><em>“Highlighting lesser-known contenders for your next serverless project” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22Highlighting+lesser-known+contenders+for+your+next+serverless+project%22+via+%40chrischinch&amp;url=https://blog.codeship.com/going-serverless-compare-your-faas-options/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h3>Google App Engine</h3>\n<p>I haven’t included the better-known <a href=\"https://cloud.google.com/functions/\">Google Cloud Functions</a> on this list, but long before “serverless” existed as a word, and even before Lambda, there was <a href=\"https://cloud.google.com/appengine/\">Google’s App Engine</a>.</p>\n<p>It supports Node.js, Java, Ruby, C#, Go, Python, and PHP, adds features such as routing traffic to different versions and applications, security, and access to Google’s other cloud services. I wonder if App Engine and Cloud Functions will ever merge, but for now, it’s a reliable option with ten years of development and usage.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/11/faas-gcp.png\" alt=\"\" width=\"2188\" height=\"1594\" class=\"size-full wp-image-5830\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-gcp.png 2188w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-gcp-300x219.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-gcp-768x560.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-gcp-549x400.png 549w\" sizes=\"(max-width: 2188px) 100vw, 2188px\"><p class=\"wp-caption-text\">Google App Engine</p>\n</div>\n<h3>Webtask</h3>\n<p>From the team behind Auth0, <a href=\"https://webtask.io/\">Webtask</a> is a free serverless platform for undemanding projects written in JavaScript.</p>\n<p>Despite this (lack of) cost, it has a decent CLI tool and support for secrets, NPM modules, logs, cron tasks, custom domains, and a whole lot of other features. Webtask requires familiarity with the concepts of serverless, but for anyone with that knowledge looking for a service to experiment with, then it’s perfect.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/11/fass-webtask.png\" alt=\"\" width=\"2833\" height=\"1535\" class=\"size-full wp-image-5831\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/fass-webtask.png 2833w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/fass-webtask-300x163.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/fass-webtask-768x416.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/fass-webtask-738x400.png 738w\" sizes=\"(max-width: 2833px) 100vw, 2833px\"><p class=\"wp-caption-text\">Webtask</p>\n</div>\n<h3>Apex</h3>\n<p>Using a Node.js shim, <a href=\"https://apex.run/\">Apex</a> lets you use AWS Lambda with languages that it doesn’t support. As Lambda adds more language support, Apex may become less useful, but for now, it still plugs a couple of useful holes.</p>\n<p>As an open-source project, it does leave me wondering how quick it is at supporting new features as they emerge. But currently, it supports a wide range of Lambda functionality.</p>\n<h3>PythonAnywhere</h3>\n<p>As the name suggests, <a href=\"https://www.pythonanywhere.com/\">PythonAnywhere</a> only supports Python and is aimed at the education market.</p>\n<p>It’s more of a fully featured online IDE and hosting environment than pure serverless, but it does mean that smaller internet-connected devices can access the power of Python, so it shares some similarities. And for devices that have no screen, the platform can accept code pushes from any public repository.</p>\n<h3>Apache OpenWhisk</h3>\n<p><a href=\"https://openwhisk.incubator.apache.org/\">Apache OpenWhisk</a> is a promising open-source option for anyone who prefers complete control of their applications.</p>\n<p>Figuring out how to get started is a little confusing, a common problem with open-source projects. I followed a Getting Started guide that took about 30 seconds before I received an error message and got stuck.</p>\n<p>If you’re less concerned about the self-hosting aspect, then IBM’s cloud functions use OpenWhisk under the hood. A quick search will find you dozens of resources to help get started, but most are written by IBM employees, so they still push you down the IBM Cloud platform.</p>\n<p>The biggest stumbling block I hit was how to use OpenWhisk without IBM Cloud. I finally hit upon <a href=\"https://thenewstack.io/hands-guide-creating-first-serverless-application-apache-openwhisk/\">this guide from The New Stack</a> that suggests using Vagrant for local testing. This caused me to dig into <a href=\"https://github.com/apache/incubator-openwhisk\">the codebase for OpenWhisk</a> and discover that while it’s possible to install and run on most platforms and start accepting requests, it’s complex.</p>\n<p><span class=\"hs-cta-wrapper\"><span class=\"hs-cta-node hs-cta-964db6a6-69da-4366-afea-b129019aff07\">!Sign up for a free Codeship Account</span> </span></p>\n<h3>IBM Cloud Functions</h3>\n<p>As <a href=\"https://console.bluemix.net/openwhisk/\">IBM Cloud Functions</a> is hosted Openwhisk, I’ll focus on what the service adds on top. Openwhisk has one of the better selections of runtimes and includes languages that better represent IBM’s priorities such as Swift, PHP, and Java.</p>\n<p>Recently IBM added a composer tool that lets you combine different services programmatically. They’re pushing hard to show users what pieces of their cloud puzzle fit together to meet certain use cases. One of the biggest advantages of Openwhisk is its integrated access to IBM’s Watson service, plugging your small internet-connected devices into a powerful artificial intelligence.</p>\n<h3>Spotinst</h3>\n<p>You have possibly never heard of Spotinst as a cloud provider, but it also has <a href=\"https://spotinst.com/products/spotinst-functions/\">a serverless offering</a> that supports JavaScript, Ruby, Python and Java 8 and has a reasonable <a href=\"https://spotinst.com/products/spotinst-functions/pricing/\">free tier</a>.</p>\n<p>Spotinst is pretty much a host for the <a href=\"https://serverless.com/\">Serverless Framework</a>, so its documentation is a little thin, and you’ll have to jump between the two.</p>\n<h3>Weblab</h3>\n<p>Currently in private beta, their website is a little lacking in information, but <a href=\"https://weblab.io/\">Weblab</a> (will) offer JavaScript-based microservice hosting. <a href=\"https://weblab.io/#pricing\">Pricing</a> is average, and more of a Heroku-style model — based on the number of processes you have running than compute time.</p>\n<h3>Hook.io</h3>\n<p>While it doesn’t claim to be serverless, <a href=\"https://hook.io/\">Hook.io</a> offers microservices and webhook hosting that are close enough to the concept for me to include here. The platform supports a large range of programming and scripting languages, and anything that has an HTTP or cURL client can request a response.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/11/faas-hookio.jpg\" alt=\"\" width=\"993\" height=\"655\" class=\"size-full wp-image-5832\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-hookio.jpg 993w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-hookio-300x198.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-hookio-768x507.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-hookio-606x400.jpg 606w\" sizes=\"(max-width: 993px) 100vw, 993px\"><p class=\"wp-caption-text\">Hook.io</p>\n</div>\n<h3>Kubeless</h3>\n<p>If you are already using Kubernetes for other aspects of your infrastructure, then <a href=\"https://kubeless.io/\">Kubeless</a> adds a “ThirdPartyResource” function definition that allows you to deploy small code units to your cluster without the need for building container images each time.</p>\n<p>It supports Python, Node.js, and Ruby, and also integrates with Kafka and Prometheus, again bringing serverless concepts to preexisting infrastructures.</p>\n<h3>OpenFaas</h3>\n<p>In a similar vein to Kubeless, <a href=\"https://github.com/openfaas/faas\">OpenFaas</a> is a framework for building serverless functions with Docker and Kubernetes.</p>\n<p>In theory, it supports any language supported by Linux and Windows containers, has its own web UI, and leverages a lot of the scaling and metrics features of Kubernetes, Docker, and Prometheus. This involves a modicum of initial setup on your part, and as a new project, <a href=\"https://github.com/openfaas/faas/tree/master/guide\">the current documentation</a> is lacking. However, once <a href=\"https://github.com/openfaas/faas/tree/master/guide#deployment-guides-start-here\">you’re set up</a>, I recommend <a href=\"https://blog.alexellis.io/quickstart-openfaas-cli/\">this blog post</a> that shows you how to use the OpenFaas CLI to create and deploy functions.</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/11/faas-openfass.jpg\" alt=\"\" width=\"962\" height=\"615\" class=\"size-full wp-image-5833\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-openfass.jpg 962w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-openfass-300x192.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-openfass-768x491.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/11/faas-openfass-626x400.jpg 626w\" sizes=\"(max-width: 962px) 100vw, 962px\"><p class=\"wp-caption-text\">OpenFaaS</p>\n</div>\n<h3>IronFunctions</h3>\n<p>Another solution that leverages a container-based infrastructure, <a href=\"https://open.iron.io/\">IronFunctions</a> is an open-source serverless framework that you can self-host or use Iron’s FaaS offering.</p>\n<p>As it runs in containers, you can use any language supported by Linux and Windows. IronFunctions supports AWS Lambda format and the ability to import existing Lambda functions, and a CLI tool for easy creation and deployment of functions.</p>\n<p>The project is less than a year old, but with backing from a well-established cloud-native provider, it shows promise and looks well designed.</p>\n<h3>Serverless Framework</h3>\n<p>As the name implies, <a href=\"https://serverless.com/framework/docs/\">the Serverless Framework</a> is not so much a platform but a framework that helps you create serverless applications on top of other platforms.</p>\n<p>The intention is that you can write your code once and deploy to whichever platform you prefer. In reality, the experience varies depending on the languages and features each platform supports. You might it find it best to start developing from a “minimum shared feature set,” separating out platform-specific features into supplemental functions.</p>\n<h2>Conclusion as a Service</h2>\n<p>Phew. That’s a lot of options to consider, and I’m sure I missed one or two. I’d love to hear which you’ve tried, your experiences, and recommendations.</p>\n<hr>\n<p><em>“Going Serverless? Compare Your FaaS Options” via @chrischinch</em><br><a href=\"https://twitter.com/share?text=%22Going+Serverless%3F+Compare+Your+FaaS+Options%22+via+%40chrischinch&amp;url=https://blog.codeship.com/going-serverless-compare-your-faas-options/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/going-serverless-compare-your-faas-options/\">Going Serverless? Compare Your FaaS Options</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"Industry"
            ]
        },
        {
            "title": "An Overview of the Kontena Platform",
            "pubDate": "2017-10-19 15:15:39",
            "link": "https://blog.codeship.com/an-overview-of-the-kontena-platform/",
            "guid": "https://blog.codeship.com/?p=5672",
            "author": "Chris Ward",
            "thumbnail": "https://blog.codeship.com/wp-content/uploads/2017/10/kontena-platform.jpg",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span>Back in my Docker hosting post, I noted that deploying and orchestrating containers live was still a missing step in the Docker workflow for many developers. A handful of complex orchestration tools entered to fill the void, with large cloud companies offering to host your setup for you. In that post, I intentionally avoided tools […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/an-overview-of-the-kontena-platform/\">An Overview of the Kontena Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">6</span><span class=\"rt-label\"> minutes</span></span><p>Back in <a href=\"https://blog.codeship.com/the-shortlist-of-docker-hosting/\">my Docker hosting post</a>, I noted that deploying and orchestrating containers live was still a missing step in the Docker workflow for many developers. A handful of complex orchestration tools entered to fill the void, with large cloud companies offering to host your setup for you. In that post, I intentionally avoided tools that sat in the middle of this process by helping you to deploy containers to cloud services, but there are plenty of them, including <a href=\"https://cloud.docker.com/\">Docker’s own official cloud service</a>. There is still plenty of opportunity for similar services and less than a month ago, I heard of a new option, <a href=\"https://kontena.io/\">Kontena</a>.</p>\n<p>Kontena is a (<a href=\"https://kontena.io/pricing\">moderately expensive</a>) SaaS platform that you can install on cloud providers or your own hardware. A lot of the core code is <a href=\"https://github.com/kontena/kontena\">open source</a>, but I’m unclear if you can run the platform without paying for it.</p>\n<p>For any of you already experienced with core Docker tools like Swarm and Compose, Kontena follows similar patterns but adds features to them specific to the platform. Again, this is a common path to follow for similar existing services.</p>\n<p>Kontena has a <a href=\"https://kontena.io/docs/quick-start.html\">great quick start guide</a>, so I will use that as a base to discuss the platform further.</p>\n<hr>\n<p><em>“Kontena is a SaaS platform that helps deploy containers to cloud services.” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22Kontena+is+a+SaaS+platform+that+helps+deploy+containers+to+cloud+services.%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/an-overview-of-the-kontena-platform/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<h2>Set Up the Platform</h2>\n<p>You can create your platform of nodes using a <a href=\"https://kontena.io/docs/tools/cli.html\">CLI tool</a> or a web interface. The CLI tool offers a lot more options, and the web interface is better suited to monitoring. Kontena supports cloud hosting (for extra charges) with <a href=\"https://kontena.io/docs/using-kontena/install-nodes/aws-ec2.html\">AWS EC2</a>, <a href=\"https://kontena.io/docs/using-kontena/install-nodes/azure.html\">Azure</a>, <a href=\"https://kontena.io/docs/using-kontena/install-nodes/digitalocean.html\">DigitalOcean</a>, <a href=\"https://kontena.io/docs/using-kontena/install-nodes/packet.html\">Packet</a>, and <a href=\"https://kontena.io/docs/using-kontena/install-nodes/upcloud.html\">UpCloud</a>. You can also add nodes manually to <a href=\"https://kontena.io/docs/using-kontena/install-nodes/ubuntu.html\">Ubuntu</a> and <a href=\"https://kontena.io/docs/using-kontena/install-nodes/container-linux.html\">Container Linux</a> hosts or use <a href=\"https://kontena.io/docs/using-kontena/install-nodes/docker-compose.html\">Docker Compose</a> to streamline the process further.</p>\n<p>For this article (and in Kontena’s quick start), I used a Vagrant installation, which still shows up in the Kontena portal. It looks like their system images are based on <a href=\"https://blog.codeship.com/an-introduction-to-coreos/\">CoreOS</a>, which opens the platform to a lot of potential.</p>\n<p>Next, create your platform and give it a name. You can use the web interface or the CLI tool.</p>\n<pre><code class=\"bash\">kontena cloud platform create &lt;PLATFORM_NAME&gt;</code></pre>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-platform.jpg\" alt=\"\" width=\"1280\" height=\"862\" class=\"size-full wp-image-5673\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-platform.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-platform-300x202.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-platform-768x517.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-platform-594x400.jpg 594w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">Create a platform</p>\n</div>\n<p>The first subcommand (<code>cloud</code>) allows you to interact with aspects of the cloud service, such as the infrastructure, individual nodes, containers, and storage volumes.</p>\n<h2>Add Nodes</h2>\n<p>With a platform created, you need to add individual nodes to it. Kontena will treat all nodes as part of the service, no matter where you host each one.</p>\n<p>You add nodes from the CLI tool, selecting the appropriate provider. For example, with Vagrant, it’s the following:</p>\n<pre><code class=\"bash\">kontena vagrant node create</code></pre>\n<p>And for AWS, it’s:</p>\n<pre><code class=\"bash\">kontena aws node create</code></pre>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-node.jpg\" alt=\"\" width=\"1280\" height=\"835\" class=\"size-full wp-image-5675\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-node.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-node-300x196.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-node-768x501.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-node-613x400.jpg 613w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">Add nodes</p>\n</div>\n<p>You can view all your current nodes with the following CLI command:</p>\n<pre><code class=\"bash\">kontena node list</code></pre>\n<p>or under the <em>Nodes</em> tab of the web interface:</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-nodes.jpg\" alt=\"\" width=\"1280\" height=\"695\" class=\"size-full wp-image-5674\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-nodes.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-nodes-300x163.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-nodes-768x417.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-nodes-737x400.jpg 737w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">See all nodes</p>\n</div>\n<h2>Create an Application Stack</h2>\n<p>Now that the infrastructure is ready, it’s time to create an application, or “stack” in Kontena terminology. You create stacks by defining a ‘<a href=\"https://kontena.io/docs/using-kontena/stack-file.html\">stack file</a>‘ that is like a Docker Compose file, with some extra values to match the Kontena platform.</p>\n<p>You can see what stacks you are running with the following command:</p>\n<pre><code class=\"bash\">kontena stack ls</code></pre>\n<p>Or details of an individual stack with:</p>\n<pre><code class=\"bash\">kontena service show &lt;STACK_NAME&gt;/&lt;SERVICE_NAME&gt;</code></pre>\n<p>There isn’t a specific tab in the web interface for stacks, but individual tabs exist for each component of a stack; for this example, <em>Services</em> and <em>Vault</em> (for secrets management).</p>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-services.jpg\" alt=\"\" width=\"1280\" height=\"832\" class=\"size-full wp-image-5676\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-services.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-services-300x195.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-services-768x499.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-services-615x400.jpg 615w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">Services tab</p>\n</div>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-vault.jpg\" alt=\"\" width=\"1280\" height=\"470\" class=\"size-full wp-image-5677\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-vault.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-vault-300x110.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-vault-768x282.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-vault-1089x400.jpg 1089w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">Vault tab</p>\n</div>\n<p><span class=\"hs-cta-wrapper\"><span class=\"hs-cta-node hs-cta-964db6a6-69da-4366-afea-b129019aff07\">!Sign up for a free Codeship Account</span> </span></p>\n<h2>Run Your Application</h2>\n<p>Accessing your application depends slightly on where the nodes in your platform are hosted. Using the <code>kontena service show</code> command and clicking through to service details in the web application will show you the public IP and DNS addresses. However, if you are using Vagrant, you will need the private IP address, which you can find with:</p>\n<pre><code class=\"bash\">kontena node show &lt;PUBLIC_NODE_NAME&gt; | grep 'private ip'</code></pre>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-ip.jpg\" alt=\"\" width=\"788\" height=\"256\" class=\"size-full wp-image-5678\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-ip.jpg 788w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-ip-300x97.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-ip-768x250.jpg 768w\" sizes=\"(max-width: 788px) 100vw, 788px\"><p class=\"wp-caption-text\">IP and DNS details</p>\n</div>\n<p>Kontena also provides an overview of resource usage and logs of all your nodes and services in the web application, as well as a briefer overview from the command line:</p>\n<pre><code class=\"bash\">kontena service stats &lt;STACK_NAME&gt;/&lt;SERVICE_NAME&gt;</code></pre>\n<div class=\"wp-caption aligncenter\">\n<img src=\"https://blog.codeship.com/wp-content/uploads/2017/10/kontena-overview.jpg\" alt=\"\" width=\"1280\" height=\"823\" class=\"size-full wp-image-5679\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-overview.jpg 1280w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-overview-300x193.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-overview-768x494.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/kontena-overview-622x400.jpg 622w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"><p class=\"wp-caption-text\">Overview tab</p>\n</div>\n<p>For more fine-grained and long-term statistics collection, Kontena allows you to connect platforms to external collection services using the <a href=\"https://github.com/b/statsd_spec\">StatsD protocol</a>. You do this using the <code>grid</code> subcommand that is generally used for self-hosted Kontena platforms, but you can also use it to customize the SaaS platform.</p>\n<pre><code class=\"bash\">kontena grid update --statsd-server &lt;STATSD_SERVER&gt;:8086 &lt;GRID_NAME&gt;</code></pre>\n<p>The grid typically has the same name as the platform, but if you want to check, use the following command:</p>\n<pre><code class=\"bash\">kontena grid list</code></pre>\n<h3>Secrets management</h3>\n<p>I briefly mentioned secrets management above. This is a growing trend in container-based infrastructures; I’ve written about <a href=\"https://blog.codeship.com/docker-secrets-management/\">Docker’s own secrets management</a> and <a href=\"https://blog.codeship.com/hashicorp-tools-useful-in-ci/\">HashiCorp’s Vault</a>. I’m not sure what Kontena uses, but the principles are the same.</p>\n<pre><code class=\"bash\">kontena vault write &lt;NAME&gt; &lt;VALUE&gt;\nkontena vault read &lt;NAME&gt;</code></pre>\n<p>Or more practically, you can share the secrets in the <em>kontena.yml</em> file:</p>\n<pre><code class=\"yaml\">services:\n  wordpress:\n  …\n    environment:\n      WORDPRESS_DB_HOST: mysql\n      WORDPRESS_DB_USER: wordpress\n      WORDPRESS_DB_NAME: wordpress\n    secrets:\n      - secret: wordpress-mysql-password\n        name: WORDPRESS_DB_PASSWORD\n        type: env\n  mysql:\n    …\n    environment:\n      MYSQL_DATABASE: wordpress\n      MYSQL_USER: wordpress\n    secrets:\n      - secret: wordpress-mysql-root\n        name: MYSQL_ROOT_PASSWORD\n        type: env\n      - secret: wordpress-mysql-password\n        name: MYSQL_PASSWORD\n        type: env</code></pre>\n<p>Kontena also adds <a href=\"https://kontena.io/docs/using-kontena/vault.html#using-letsencrypt-certificates\">certificate management</a> with <a href=\"https://letsencrypt.org/\">LetsEncrypt</a>, allowing you to manage the entire process from the CLI tool.</p>\n<h3>Load balancing</h3>\n<p>Kontena includes support for <a href=\"https://kontena.io/docs/using-kontena/loadbalancer.html\">load balancing</a>, which you define in your <em>kontena.yml</em> file and then link services to it.</p>\n<pre><code class=\"yaml\">cs_loadbalancer:\n  image: kontena/lb:latest\n  ports:\n    - 80:80\nwordpress:\n  …\n  environment:\n    WORDPRESS_DB_HOST: mysql\n    WORDPRESS_DB_USER: wordpress\n    WORDPRESS_DB_NAME: wordpress\n    KONTENA_LB_INTERNAL_PORT: 80\n  links:\n    - cs_loadbalancer</code></pre>\n<p>And the load balancer will now appear in your list of active services.</p>\n<h3>Volumes</h3>\n<p><a href=\"https://kontena.io/docs/using-kontena/volumes.html\">Kontena volumes</a> work in a similar way to volumes in Docker, but add the ability to define the ‘scope’ of a mounted volume and if it’s accessible to each instance, stack, or across the whole platform. There’s a parameter for defining the driver, but I couldn’t find any details on what’s supported.</p>\n<pre><code class=\"bash\">kontena volume create --driver &lt;DRIVER&gt; --scope &lt;SCOPE&gt; &lt;VOLUME_NAME&gt;</code></pre>\n<h2>All You Need?</h2>\n<p>Kontena is a developer-friendly and easy-to-use platform, with a lot of compelling features to suit a lot of complex application stacks. But bearing in mind you also have to pay hosting costs, is it worth the price versus running your own Mesos or Kubernetes cluster?</p>\n<p>As with many SaaS platforms, you offset convenience for developer time spent. I’d love to know if you think the feature list justifies the price.</p>\n<hr>\n<p><em>“An Overview of the Kontena Platform” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22An+Overview+of+the+Kontena+Platform%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/an-overview-of-the-kontena-platform/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/an-overview-of-the-kontena-platform/\">An Overview of the Kontena Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"Development"
            ]
        },
        {
            "title": "Does GraphQL Reduce the Need for Documentation?",
            "pubDate": "2017-09-19 15:15:21",
            "link": "https://blog.codeship.com/documenting-graphql/",
            "guid": "https://blog.codeship.com/?p=5555",
            "author": "Chris Ward",
            "thumbnail": "https://blog.codeship.com/wp-content/uploads/2017/09/graphiql-browser.gif",
            "description": "\n<p><span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span>Before we begin, note that this post isn’t intended as an introduction to GraphQL. For a beginner’s guide, I suggest Derek Haynes’ Codeship post or howtographql.com. As a technical writer, I was intrigued by the claim that GraphQL reduces the time you need to spend on documenting an API and reduces the amount of documentation […]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/documenting-graphql/\">Does GraphQL Reduce the Need for Documentation?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "content": "\n<span class=\"rt-reading-time\"><span class=\"rt-label\">Reading Time: </span><span class=\"rt-time\">5</span><span class=\"rt-label\"> minutes</span></span><p>Before we begin, note that this post isn’t intended as an introduction to <a href=\"https://graphql.org/learn/\">GraphQL</a>. For a beginner’s guide, I suggest <a href=\"https://blog.codeship.com/an-introduction-to-graphql-via-the-github-api/\">Derek Haynes’ Codeship post</a> or <a href=\"https://www.howtographql.com/basics/0-introduction/\">howtographql.com</a>.</p>\n<p>As a technical writer, I was intrigued by the claim that GraphQL reduces the time you need to spend on documenting an API and reduces the amount of documentation your application needs. I wanted to investigate how realistic this claim is.</p>\n<hr>\n<p><em>“Investigating how GraphQL reduces the time needed to document an API” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22Investigating+how+GraphQL+reduces+the+time+needed+to+document+an+API%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/documenting-graphql/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The biggest difference between a GraphQL and REST API from a documentation perspective is that REST focuses on individual endpoints, and a developer has to combine them together to accomplish a task. Whereas the focus of GraphQL is on the task or data needed itself, and the developer can make one API call to request the data they need.</p>\n<p>The role of documentation with a REST API is to explain the individual endpoints, what function they perform, and the parameters a developer can pass to them. With a GraphQL API, you describe the data types, fields, and the interaction points between them, and a developer can assemble an appropriate query to get the information they need. With both technologies, you document components but from different perspectives.</p>\n<p>For example, in a blog application containing authors and articles, with each article written by an author, a traditional REST-based approach might be to get a list of all posts, and for each post, then find their author, requiring two API calls for each post. Considering a more complex example, like a social network (GraphQL is a Facebook invention), then each user might have dozens of related database tables, and now you start to see why technically speaking, GraphQL makes a lot of sense in this data-heavy world.</p>\n<p><span class=\"hs-cta-wrapper\"><span class=\"hs-cta-node hs-cta-964db6a6-69da-4366-afea-b129019aff07\">!Sign up for a free Codeship Account</span> </span></p>\n<p>GraphQL has a new <a href=\"https://www.graph.cool/docs/faq/graphql-sdl-schema-definition-language-kr84dktnp0/\">schema definition language</a> (SDL) to learn, which took me a while to understand. A lot of documentation and blog posts jump from schema definitions to demo applications without much explanation of how they relate to each other.</p>\n<p>For this article, which isn’t about the intricacies of GraphQL itself, I will use <a href=\"https://github.com/ChrisChinchilla/graphql-demo\">a demo application</a> originally created by Eric Baer, with small changes for the purposes of this article.</p>\n<p>As always, install dependencies with <code>npm install</code>, start the application with <code>npm start</code>, and open the application in your browser with the address <code>&lt;https://localhost:5000&gt;</code>.</p>\n<p>Look at the <em><a href=\"https://github.com/ChrisChinchilla/graphql-demo/blob/master/schema.js\">schema.js</a></em> file for the JavaScript implementation of the schema behind this example application. To query and return all authors and their posts, you would use the following query:</p>\n<pre><code class=\"bash\">{\n  posts {\n    title\n      author {\n        name\n      }\n  }\n}</code></pre>\n<p>The nested syntax expresses a query for all posts, displaying the title, the author, and their name. Using the in-built GraphiQL browser, you can experiment with the API and the data it exposes. If you’re not sure of the fields and relationships available, then start typing and the tool will auto-complete what’s available.</p>\n<p><img src=\"https://blog.codeship.com/wp-content/uploads/2017/09/graphiql-browser.gif\" alt=\"GraphiQL browser\" width=\"916\" height=\"685\" class=\"aligncenter size-full wp-image-5557\"></p>\n<p>This interactive aspect is one reason why some have said that GraphQL replaces the need for documentation, but also the (collapsed by default) <em>Docs</em> right-hand pane. This autogenerates explanatory text based on the three main entry types into a GraphQL schema: <code>Query</code>, <code>Mutation</code>, and <code>Subscription</code>.</p>\n<p>This example application only has a <code>Query</code> defined, and that’s the query named ‘Blog’. Click it, and you’ll see what objects it returns (<code>posts</code>). Click on that, and you can see the fields in the object. Clicking on each field in the object will give you descriptions of the field type and so on.</p>\n<p><img src=\"https://blog.codeship.com/wp-content/uploads/2017/09/graphiql-docs.jpg\" alt=\"GraphiQL docs\" width=\"1028\" height=\"797\" class=\"aligncenter size-full wp-image-5558\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-docs.jpg 1028w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-docs-300x233.jpg 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-docs-768x595.jpg 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-docs-516x400.jpg 516w\" sizes=\"(max-width: 1028px) 100vw, 1028px\"></p>\n<p>So far so good, but this isn’t very ‘human’ documentation. How can you add your own explanations? Version 0.7.0 of GraphiQL will display any comments you add above types or fields and render them in the documentation explorer:</p>\n<pre><code class=\"bash\">{\n  posts {\n    # Title of article\n    title\n      # Author of article\n      author {\n        name\n      }\n  }\n}</code></pre>\n<p>And in the JavaScript code of the example, you use the <code>description</code> property. This accepts markdown:</p>\n<pre><code class=\"javascript\">const Author = new GraphQLObjectType({\n    name: \"Author\",\n    description: \"Author of article\",\n    fields: {\n        id: {type: GraphQLInt},\n        name: {type: GraphQLString, description: \"Name of author\"},\n        company: {type: GraphQLString},\n    }\n});</code></pre>\n<p><img src=\"https://blog.codeship.com/wp-content/uploads/2017/09/graphiql-description.png\" alt=\"GraphiQL with extra descriptions\" width=\"1028\" height=\"797\" class=\"aligncenter size-full wp-image-5559\" srcset=\"https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-description.png 1028w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-description-300x233.png 300w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-description-768x595.png 768w, https://1npo9l3lml0zvr6w62acc3t1-wpengine.netdna-ssl.com/wp-content/uploads/2017/09/graphiql-description-516x400.png 516w\" sizes=\"(max-width: 1028px) 100vw, 1028px\"></p>\n<h2>But Is It Enough?</h2>\n<p>GraphQL offers a lot of positives on the documentation front for simple APIs. For example, keeping documentation in sync with API changes is easy, as once a field, type, or query changes in code, so do the docs.</p>\n<p>I personally feel the same rules apply for documenting all APIs whether they are REST- or GraphQL-based. Documenting API endpoints explains how individual tools work, explaining how to use those tools together is a whole other area of documentation effort. This means there is still need for documentation efforts in on-boarding, getting started guides, tutorials, and conceptual documentation. An application or tool is typically far more than just an API.</p>\n<p><a href=\"https://pronovix.com/api-docs-london-2017#andrew\">In his presentation at API the Docs</a>, <a href=\"https://twitter.com/andrewjtech\">Andrew Johnston of Shopify</a> explained their experience documenting with GraphQL and reiterates my thoughts. From a documentation perspective, GraphQL is in essence, an API spec, much like other API specs like <a href=\"https://swagger.io/\">Swagger</a> or <a href=\"https://apiblueprint.org/\">API Blueprint</a>. Granted, it’s much more tightly coupled to code than these specs, but this (directly) benefits developers more than writers or readers.</p>\n<p>I am a fan of the task focus that GraphQL offers over REST; if you can expose most public functionality of your application as an interaction of the entry points that GraphQL provides, then from a documentation perspective, maybe that’s all your application needs.</p>\n<p>I am also a fan of interactive developer portals that embrace the modern potential of HTML, so love the API explorer that allows users to explore with live data, for a great example <a href=\"https://developer.github.com/v4/explorer/\">try the GitHub API with your own data</a>.</p>\n<p>In summary: Never fear, developers, technical writers, and those who like to write documentation (yes, they exist) are around for a while longer yet to bug you about explaining your code. Until we all get replaced by robots, but that’s a whole other article.</p>\n<hr>\n<p><em>“Does GraphQL Reduce the Need for Documentation?” via @ChrisChinch</em><br><a href=\"https://twitter.com/share?text=%22Does+GraphQL+Reduce+the+Need+for+Documentation%3F%22+via+%40ChrisChinch&amp;url=https://blog.codeship.com/documenting-graphql/\" target=\"_blank\">Click To Tweet</a></p>\n<hr>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.codeship.com/documenting-graphql/\">Does GraphQL Reduce the Need for Documentation?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.codeship.com/\">via @codeship</a>.</p>\n",
            "enclosure": {},
            "categories": [
"Development"
            ]
        }
    ]
}